[{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c558"
  },
  "name": "Taivaskallio",
  "coordinates": {
    "lat": 60.219862,
    "lon": 24.952236
  },
  "url": "https://fi.wikipedia.org/wiki/Taivaskallio",
  "quests": "fi_type",
  "category": "sight",
  "description": "Taivaskallio is a high rocky park and former anti-aircraft base in Käpylä, Helsinki. Located between Pohjolankatu, Panuntie, the railway line and Käpyläntie, it served as a heavy anti-aircraft battery during the wars of 1939-1944. There is a monument to those who served in the war, several anti-aircraft stations and one sealed cannon.\n\nFrom the top of the hill, there are great views over the city. Taivaskallio is the highest natural rock in Helsinki. The park is a popular place to sunbathe and picnic in the summer. During winter, it is a popular sledding hill.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c559"
  },
  "name": "Monument commemorating the City of Helsinki’s 400th anniversary",
  "coordinates": {
    "lat": 60.216588,
    "lon": 24.976425
  },
  "url": "https://www.hamhelsinki.fi/veistos/helsingin-400-vuotismuistomerkki/",
  "quests": "fi_type",
  "category": "sight",
  "description": "The monument commemorating the City of Helsinki's 400th anniversary is located in Vanha Kaupunki (Old Town), specifically on Kirkkorinne. It was designed by sculptor Yrjö Rosola and unveiled in 1950. The monument features a relief depicting the profile of Gustav Vasa, the King of Sweden who founded Helsinki in 1550. The inscription on the stone reads: \"Tälle paikalle perusti Kustaa Vaasa Helsingin kaupungin vuonna 1550. På denna plats grundade Gustav Vasa Helsingfors stad år 1550.\" which translates to \"On this site, Gustav Vasa founded the city of Helsinki in 1550.\". The monument marks the spot where Vasa established the city.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55a"
  },
  "name": "The Church of Helsinki Old Town",
  "coordinates": {
    "lat": 60.216037,
    "lon": 24.975965
  },
  "url": "https://en.wikipedia.org/wiki/Helsinki_Old_Church",
  "quests": "fi_type",
  "category": "church",
  "description": "The Helsinki Old Church (Finnish: Helsingin vanha kirkko, Swedish: Gamla kyrkan) is the oldest church in the city center of Helsinki, Finland. Designed by Carl Ludvig Engel, it was completed in 1826. Originally intended as a temporary structure while the Helsinki Cathedral was under construction, the rapid population growth ensured its continued use.\n\nThe neoclassical wooden church features a simple yet elegant design with Doric-style pillars and a delicate bell tower. It is located in the Old Church Park (Vanha kirkkopuisto), which formerly served as a cemetery and is sometimes called \"Plague Park\" due to the victims of the 1710 plague buried there. The church is a popular venue for weddings and other events.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55b"
  },
  "name": "Maunulan vanha hyppyritorni",
  "coordinates": {
    "lat": 60.223503,
    "lon": 24.923068
  },
  "url": "https://www.maunula.net/2011/10/14/maunulanpuro-ja-hyppyrimaki/",
  "quests": "fi_type",
  "category": "hill",
  "description": "The old Maunula ski jumping tower (Maunulan vanha hyppyritorni) was built in 1956 on a natural hill about 15 meters high, near Pekansuo. It hosted several district championship competitions. The ski jumping tower was demolished in the 1980s. Currently, there's a proposal to build workout stairs at the site of the old ski jumping tower. Illuminated stairs would improve the area's appearance. In the 1930s, the Maunula hill and the nut grove by the ski jump were popular recreational areas.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55c"
  },
  "name": "Patola Fortress Area",
  "coordinates": {
    "lat": 60.237973,
    "lon": 24.951996
  },
  "url": "",
  "quests": "fi_type",
  "category": "fortification",
  "description": "The Patola fortress area, located in Oulunkylä, Helsinki, is part of the Krepost Sveaborg, a series of fortifications built during World War I to protect St. Petersburg. Construction began in 1915. The area included Support Base XXI, with gun emplacements and other structures. Today, some remnants remain, including a preserved cannon battery armed with four 229 mm model 1877 fortress cannons. One of the area's caves is used as a shelter. Roads like Teinintie follow the paths of old cannon routes. Some fortifications have been lost to residential development. The area is a protected historical site.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55d"
  },
  "name": "Statue of Mahatma Gandhi",
  "coordinates": {
    "lat": 60.191462,
    "lon": 24.965262
  },
  "url": "https://www.tripadvisor.com/Attraction_Review-g189934-d19030737-Reviews-Statue_of_Mahatma_Gandhi-Helsinki_Uusimaa.html",
  "quests": "fi_type",
  "category": "sight",
  "description": "The statue of Mahatma Gandhi is located in Allotrianpuisto, Helsinki, specifically at Hämeentie 57. The bronze statue, gifted by the Indian government, was unveiled on September 20, 2019. It stands 185 centimeters tall on a pedestal made of Finnish brown granite. Created by Indian sculptor Gautam Pal, the statue depicts Gandhi during the 1930 Salt March. The base of the statue features an inscription with one of Gandhi's aphorisms in Finnish, Swedish, English and Hindi: \"Rauhaan ei ole tietä, rauha on tie\" (\"There is no way to peace, peace is the way\"). The unveiling ceremony was attended by the foreign ministers of both India and Finland, as well as the deputy mayor of Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55e"
  },
  "name": "Ruskeasuon hyppyrimäki",
  "coordinates": {
    "lat": 60.198371,
    "lon": 24.918447
  },
  "url": "https://www.geocaching.com/geocache/GC2CPXB",
  "quests": "fi_type",
  "category": "hill",
  "description": "The Ruskeasuo ski jumping hill (\"Ruskeasuon hyppyrimäki\" in Finnish) was located in the Ruskeasuo area of Helsinki. Built in 1959, it was a 22-meter hill situated in the area between Laakso, Ruskeasuo and Pasila, close to the Ruskeasuo riding halls. Unfortunately, the ski jump was demolished in the 1980s due to safety concerns and declining popularity of ski jumping as other recreational activities became more available. Today, only concrete foundations and a natural downhill slope remain, with the slope now leading into a dog park.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c55f"
  },
  "name": "Wappucivi",
  "coordinates": {
    "lat": 60.188377,
    "lon": 24.839154
  },
  "url": "https://evendo.com/locations/finland/espoo/tapiola/landmark/wappucivi",
  "quests": "fi_type",
  "category": "sight",
  "description": "Wappucivi is a cultural landmark located in Espoo, near Helsinki, Finland. It's a glacial erratic, a large rock deposited by glaciers, found in Civipuisto near Rantasauna. The rock has a titanium \"W\" on it. Legend says Wappucivi broke off from Walpurin vuori (Walpurgis mountain) when a meteorite hit it, and ice ages carried it to its current location, where the Teekkarikylä (student village) was built around it. It has been a site for pagan rituals, which evolved into the celebration of Vappu (Walpurgis night/May Day). Vappu is a significant celebration for students. The surrounding Civipuisto park is known for its Finnish landscape architecture.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c560"
  },
  "name": "Kuusiluoto",
  "coordinates": {
    "lat": 60.203874,
    "lon": 24.993894
  },
  "url": "https://fi.wikipedia.org/wiki/Kuusiluoto_(Vanhankaupunginselk%C3%A4)",
  "quests": "fi_type",
  "category": "island",
  "description": "Kuusiluoto is an island located in Helsinki, specifically in Vanhankaupunginlahti. It's a recreational area accessible via a 1.2 km duckboard path from the end of Jokisuuntie, passing through Lammassaari. Despite its name meaning \"spruce islet,\" it only has one spruce tree. The island features an old villa rented by the VKEK association, open rock meadows, and hardwood groves. From June to October, sheep graze there to maintain the landscape. It's a popular spot for birdwatching, with species like stock pigeons and nightingales. Mammals like yellow-necked mice also inhabit the island. Visitors can swim and fish at their own risk from an old dock, but open fires are prohibited.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c561"
  },
  "name": "Hakalanniemi",
  "coordinates": {
    "lat": 60.214753,
    "lon": 25.008992
  },
  "url": "",
  "quests": "fi_type",
  "category": "peninsula",
  "description": "Hakalanniemi is located in Helsinki, by the Vanhankaupunginlahti bay in Viikki. It's known for its nature observation opportunities, especially birdwatching. A large, multi-level viewing platform was completed in 2023, offering panoramic views of the bay. The platform can accommodate around 50 people and provides closer views of waders and waterfowl. The structure is accessible, with one level directly accessible from the pathway. Hakalanniemi is a popular spot for bird enthusiasts and nature lovers, with different bird species spotted. It is an important bird area with a forest area along the Vantaa river forming an ecological connection from Vanhankaupunginlahti to the Central Park.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c562"
  },
  "name": "Lammassaari Nature Boardwalk",
  "coordinates": {
    "lat": 60.211329,
    "lon": 24.990371
  },
  "url": "https://finnisharchitecture.fi/lammassaari-boardwalk/",
  "quests": "fi_type",
  "category": "nature_trail",
  "description": "Lammassaari is a recreational island and nature reserve located near Arabianranta in Helsinki. It's known for its accessible boardwalks (wooden paths), making it easy for everyone to explore the natural environment. The 3.5 km trail consists of the boardwalk and the \"Lap of Nature\" trail that goes through the reedy areas, offering excellent opportunities for bird watching, especially during migration seasons in spring and autumn. The island is part of the Viikki-Vanhankaupunginlahti nature reserve. The name Lammassaari means \"Sheep Island\", but the sheep actually reside on the neighboring Kuusiluoto island during the summer. Lammassaari also has private cottages, and visitors are advised to stay on marked paths to respect the residents' privacy.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c563"
  },
  "name": "Good Stone",
  "coordinates": {
    "lat": 60.214182,
    "lon": 24.990067
  },
  "url": "",
  "quests": "fi_type",
  "category": "sight",
  "description": "Based on the search results, there are a few interpretations of \"Good Stone\" in the Helsinki area. One could be Kivilähde (Stone Academy), a company specializing in gravestones and countertops with a location in Helsinki. The name \"Kivilähde\" translates to \"stone spring,\" originating from a factory built in Ylöjärvi on a site with a stone-bordered spring. Another interpretation could be the \"Stone Ball Stairs\" in Helsinki, a tourist attraction that combines artistic expression with historical significance. The unique staircase, adorned with large stone balls, offers a visual appeal and serves as a testament to the city's rich cultural heritage.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c564"
  },
  "name": "Pornaistenniemi Nature Trail",
  "coordinates": {
    "lat": 60.213427,
    "lon": 24.986517
  },
  "url": "https://vihreatsylit.fi/pornaistenniemen-luontopolku/",
  "quests": "fi_type",
  "category": "nature_trail",
  "description": "Pornaistenniemi Nature Trail, also known as \"The Lap of Nature\", is located in Viikki, Helsinki. It is an accessible, approximately one-kilometer-long circular route that winds through an alder grove and along the edge of a reed bed. The trail has ten stops with poems and activities promoting well-being. Along the path, there is a playground, wooden seats, a picnic spot, a bird tower, and a mirror reflecting the landscape of Vanhankaupunginlahti. The trail connects to Lammassaari island via a wide duckboard path. Pornaistenniemi itself is an eight-hectare nature reserve with diverse flora and fauna.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c565"
  },
  "name": "Vanhankaupunginkoski",
  "coordinates": {
    "lat": 60.216598,
    "lon": 24.983604
  },
  "url": "https://fi.wikipedia.org/wiki/Vanhankaupunginkoski",
  "quests": "fi_type",
  "category": "rapid",
  "description": "Vanhankaupunginkoski, meaning \"Old Town Rapids,\" marks the original site of Helsinki, founded in 1550. Located on the Vantaa River, the rapids have historically been a source of power for mills and industry since the 17th century. Today, the area offers a blend of history and nature, attracting visitors of all ages. People enjoy activities like fishing (with a permit), walking along the riverbanks, and birdwatching. Kuninkaankartanonsaari island sits between the two streams of the rapids, featuring the Museum of Technology. The red brick facades around the area reflect the industrial era.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c566"
  },
  "name": "Koskipuisto",
  "coordinates": {
    "lat": 60.215938,
    "lon": 24.980952
  },
  "url": "https://www.stadissa.fi/paikat/4064/koskipuisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Koskipuisto, meaning \"rapids park,\" is located in Kyttälä, Tampere, east of the Tammerkoski rapids. It's considered part of Finland's national landscapes, featuring many old trees, including white willows planted in the early 20th century. A tradition involves dipping first-year technology students into the water on International Workers' Day. The park's construction began in the 1890s. In the 1930s, it was renovated and expanded with the building of a power plant. The park features the sculpture \"The Shepherd\" by Yrjö Liipola. The Pikku Kakkonen play park is also located within Koskipuisto.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c567"
  },
  "name": "Kivinokka Nature Trail",
  "coordinates": {
    "lat": 60.197856,
    "lon": 25.013537
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/ulkoilualueet/kivinokan-ulkoilualue/kivinokan-luontopolku",
  "quests": "fi_type",
  "category": "nature_trail",
  "description": "Kivinokka Nature Trail is located in Helsinki, in the Kivinokka area, which is a popular recreational area. The trail is only a few hundred meters long and easily accessible, making it suitable for people with reduced mobility. The path leads to a bird-watching platform that offers great views of the Vanhankaupunginlahti nature reserve, where you can spot various bird species. The area also has old-growth forests and traditional summer cottages, creating a peaceful atmosphere.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c568"
  },
  "name": "Mäkkylänmetsä",
  "coordinates": {
    "lat": 60.224871,
    "lon": 24.834411
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Mäkkylänmetsä is an area located in Espoo, near Helsinki. It is part of the Leppävaara district. It features both residential areas and green spaces, including the Mäkkylänmetsä park and Sotatuomarinpuisto park. The city of Espoo is developing outdoor recreation routes in the area, including a lit pathway in Mäkkylänmetsä park. The area also has historical significance, with remnants of World War I fortifications. Mäkkylänmetsä is also known as a bouldering area and has bus stops like Mäkkylänmetsä. There's a memorial plaque in Mäkkylänmetsä commemorating a Romani camp from the 1950s.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c569"
  },
  "name": "Särkkäniemi Nature Reserve",
  "coordinates": {
    "lat": 60.201852,
    "lon": 25.185174
  },
  "url": "https://www.birdingplaces.eu/fi/birdingplaces/finland/sarkkaniemi-nature-reserve",
  "quests": "fi_type",
  "category": "nature_reserve",
  "description": "Särkkäniemi Nature Reserve, located on the eastern shore of Uutela in eastern Helsinki, is a diverse area with rocky shores, low-growing seashore meadows, coastal groves and black alder swamps. It was established in 1993 to protect valuable seashore meadows, a lagoon bay, and small coastal lakes. The area has remained almost untouched and boasts a rich variety of species. The reserve is also an important habitat for reptiles and amphibians, with a plentiful frog population. It is also classified as an important bat area in Helsinki. There is a 1.5 km nature trail in the area. Please note that cycling is prohibited in the Särkkäniemi nature reserve.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56a"
  },
  "name": "Roosinmäki",
  "coordinates": {
    "lat": 60.276747,
    "lon": 25.066936
  },
  "url": "https://kaupunginosat.fi/puistola/roosinmki/",
  "quests": "fi_type",
  "category": "forest",
  "description": "Roosinmäki is a 4.5-hectare nature reserve located on the border between Helsinki and Vantaa in Heikinlaakso. The area features bedrock of gneiss rich in quartz and feldspar, with layers of limestone. The forest is dominated by Scots pines, and the mineral-rich soil supports rare flowers such as field gentian, spring vetch and fly honeysuckle. It also has many old trees, which creates a habitat for fungi. Roosinmäki and Vantaa's Kalkkikallio form a border-crossing protected area duo with a valuable flora due to the calcareous soil.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56b"
  },
  "name": "Pitkäkosken Silta",
  "coordinates": {
    "lat": 60.268744,
    "lon": 24.898087
  },
  "url": "",
  "quests": "fi_type",
  "category": "bridge",
  "description": "Pitkäkoski bridge is located on the border of Helsinki and Vantaa, crossing the Vantaanjoki river. The bridge is for pedestrians and cyclists. It is located at the upper part of the Pitkäkoski rapids. The Pitkäkoski outdoor recreation center is located near the southern end of the bridge. The area around the bridge is a nature conservation area with lush vegetation. The nature trail is easily accessible and offers resting places. The riverbanks have diverse flora, and forests create a tranquil atmosphere, making it a popular spot for relaxation.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56c"
  },
  "name": "Pöllökallio",
  "coordinates": {
    "lat": 60.253221,
    "lon": 24.801916
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Pöllökallio, translating to \"Owl Rock\" in English, is a small, beautiful park or forest area located just outside of Helsinki, specifically in Vantaa. It's known for its natural beauty, especially during the summer when flowers bloom and berries like blueberries are abundant. The area features rocky terrain and is a protected natural site, specifically the rocky shore. Pöllökallio offers opportunities for outdoor activities like hiking and bouldering. In addition, there is also a playground and sports field.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56d"
  },
  "name": "Friisinkallio Nature Reserve",
  "coordinates": {
    "lat": 60.173791,
    "lon": 24.717148
  },
  "url": "https://evendo.com/locations/finland/espoo/attraction/friisinkallio-nature-reserve",
  "quests": "fi_type",
  "category": "nature_reserve",
  "description": "Friisinkallio Nature Reserve is located in Espoo, near Olari and Friisilä. It is a 26-hectare protected area, representing a diverse slice of nature surrounded by residential areas and roads. The area features impressive glacially smoothed cliffs and precipices, dry rocky pine forests, and spruce-dominated forests. In the northern part, there is a small alder grove and fern thicket. A swamp about 120 meters long can also be found there. From the top of Friisinkallio, you can see the surrounding city districts.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56e"
  },
  "name": "Maaherrantien silta",
  "coordinates": {
    "lat": 60.231151,
    "lon": 24.989898
  },
  "url": "https://fi.wikipedia.org/wiki/Maaherrantien_silta",
  "quests": "fi_type",
  "category": "bridge",
  "description": "Maaherrantien silta was a railway bridge in Helsinki, specifically in the Viikinmäki and Veräjämäki areas, that crossed the Vantaanjoki river. It was a steel lattice bridge built using rivets in the late 1930s, originally for the Herttoniemi harbor railway. Although designed for a single track, the foundations allowed for two tracks. However, the harbor railway never needed a second track. Cargo traffic on the harbor railway ended in 1992, but a portion of the track continued to serve as a maintenance connection. In the early 2000s, the bridge became part of Maaherrantie between Viikki and Oulunkylä stations. The bridge was demolished in 2021 after determining that it was too narrow and in poor condition to be used for the Raide-Jokeri light rail line. A new bridge for pedestrians and cyclists, called Tulvaniitynsilta, was built nearby.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c56f"
  },
  "name": "Vaskipellon silta",
  "coordinates": {
    "lat": 60.258139,
    "lon": 24.862459
  },
  "url": "",
  "quests": "fi_type",
  "category": "bridge",
  "description": "Vaskipellon silta is mentioned in several contexts, mainly related to Vantaa and nearby areas. In Vantaa, there's a plan from 2021 to possibly design a bridge in Vaskipelto for shared use as a skiing and outdoor recreation bridge, in collaboration with the city of Helsinki. There is also a white arch bridge in Vaskipelto. In the Mätäoja nature reserve in Vantaa, there are several bridges along the walking paths, with one area having a sign about Vaskipellon niityt (meadows). It is known that the area of Myyrmäki was inhabited already in the Stone Age.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c570"
  },
  "name": "Mätäojan kävelysilta",
  "coordinates": {
    "lat": 60.261185,
    "lon": 24.862809
  },
  "url": "https://lahiluonnonlumoa.wordpress.com/2021/07/10/mataojan-luonnonsuojelualue/",
  "quests": "fi_type",
  "category": "bridge",
  "description": "The Mätäoja walking bridge is located in Vantaa, near the border of Helsinki. More specifically, it's situated in Kaivoksela, approximately 1.3 km away from Vetokannas swimming beach. The bridge is part of the Mätäoja nature reserve. The area is known for its diverse flora and fauna, including the protected small orchid, the mosquito orchid, and the rare and endangered beetle, the willow beetle. The Mätäoja stream meanders through a lush meadow, featuring open water pools and a black alder forest. The bridge is part of an outdoor trail that is about 2.8 km long. The trail is easily accessible, wide and covered with crushed stone, making it suitable for people with reduced mobility, as well as for prams and rollators.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c571"
  },
  "name": "Haltialansilta",
  "coordinates": {
    "lat": 60.273229,
    "lon": 24.955781
  },
  "url": "https://foursquare.com/v/haltialan-silta/4f9d2e24e4b05e5ed85d8c93",
  "quests": "fi_type",
  "category": "bridge",
  "description": "Haltialansilta is located in Helsinki, specifically in the Tuomarinkylä area. It is near Haltialantie (Haltiala road) and close to places like Korkmaninpolku. The bridge is accessible via public transport; the closest train station is Malmi, and the nearest bus stop is Koetilankatu. The bridge is founded on piles, though the exact pile type is uncertain.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c572"
  },
  "name": "Kätilöopistonmäki",
  "coordinates": {
    "lat": 60.205268,
    "lon": 24.952227
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Kätilöopistonmäki is located in Helsinki and is a park area. It's known for its varied landscape, featuring maple trees on its slopes and open, rocky terrain at the top. The northern slope is integrated into Helsinki's broader forest and tree network. Notably, the slopes bordering the area contain habitats recognized as threatened or endangered, specifically fresh, medium-rich woodland and maple groves. Kätilöopistonmäki is part of the larger Kumpula District Park. In the past, a maternity hospital was located in the area, hence the name. Currently, there are plans for further development in the Kätilöopisto Maternity Hospital area.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c573"
  },
  "name": "Jyrängönpuisto",
  "coordinates": {
    "lat": 60.209447,
    "lon": 24.958352
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Jyrängönpuisto is a park located in Helsinki, specifically in the Käpylä and Kumpula area. It offers recreational opportunities. It appears to be near apartment buildings and is within walking distance of Käpylä sports park. A children's paddling pool is located in Jyrängönpuisto. The area is known for its green and park-like environment.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c574"
  },
  "name": "Kumpulanpuisto",
  "coordinates": {
    "lat": 60.212383,
    "lon": 24.962965
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Kumpulanpuisto can refer to multiple locations. There is a park with that name in Helsinki, specifically in the Peltola area. It is a small park but has basic equipment for kids such as seesaws, a slide and a sandbox. There is also Asunto Oy Riihimäen Kumpulanpuisto in Riihimäki, which is a housing complex. Additionally, Kumpulanpuisto in Kälviä is undergoing renovations. Kumpulanpuisto in Jyväskylä is also mentioned as part of a larger green services program.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c575"
  },
  "name": "Messukeskus Grove",
  "coordinates": {
    "lat": 60.205464,
    "lon": 24.934635
  },
  "url": "",
  "quests": "fi_type",
  "category": "exhibition",
  "description": "Messukeskus Grove is most likely a part of the Messukeskus Helsinki, Expo and Convention Centre. Messukeskus Helsinki is the largest and best-known convention center in Finland, located in Pasila, Helsinki. It hosts around hundred trade shows and public fairs and over 2,200 meetings and congresses annually, attracting over one million visitors. The premises include seven exhibition halls, 40 meeting rooms, and a 4,400-seat auditorium. The Holiday Inn hotel is located next to the center. Messukeskus Helsinki is a pioneer in sustainable event organization.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c576"
  },
  "name": "Rauninkallio",
  "coordinates": {
    "lat": 60.210324,
    "lon": 24.937272
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Rauninkallio is a place located in Helsinki, specifically on Rauninkuja street. It is accessible by public transportation, including bus lines 506, 57, 611, 623, and 66, train lines I and L, metro lines M1 and M2, and tram line 1T. The closest stations to Rauninkallio are Kimmontie, Käpylänaukio, Mäkelänkatu and Kalervonkatu. A resident survey describes it as a quiet and peaceful place, noting the calm, quiet wooden house area, which has a soothing atmosphere when walking between the houses.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c577"
  },
  "name": "Nyyrikinpuisto",
  "coordinates": {
    "lat": 60.21735,
    "lon": 24.947408
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Nyyrikinpuisto is a 4.4-acre park located in Helsinki, Uusimaa, Finland. It's known for its pleasant forest and scrubland, making it a suitable place for walking. The park is bordered by residential buildings to the north and west, Nyyrikintie road and Puu-Käpylä residential blocks to the south. Previously, the area included the Vuoritalo building, which was designed as a community center but was destroyed in a fire and subsequently demolished in 2012. Akseli Toivosen kenttä, a 12,000 m2 area, offers space for games.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c578"
  },
  "name": "Louhenpuisto",
  "coordinates": {
    "lat": 60.212555,
    "lon": 24.936802
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Louhenpuisto is an urban forest located in Helsinki, between the main railway line, the Pohjoisbaana cycling and pedestrian route, and Tuusulanväylä highway. It's easily accessible by public transport, with stops near the Tuusulanväylä and Pohjolankatu intersection and a short walk from Käpylä railway station.\n\nThe park has diverse vegetation, including lilies of the valley, violets and strawberries. Various bird species inhabit the area, such as finches, blackbirds, and nightingales.\n\nA unique feature is a giant's kettle, 1.4 meters in diameter and 1.7 meters deep. The remains of the Tallinmäki ski jumping hill are also found in the forest. The park also has a dog park in the northern part. The construction of Pohjoisbaana and the possible conversion of Tuusulanväylä into a boulevard pose a threat to the forest.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c579"
  },
  "name": "Isoisänniemi",
  "coordinates": {
    "lat": 60.181202,
    "lon": 24.982424
  },
  "url": "https://esoteerinenmaantiede.blogspot.com/2011/06/isoisanniemen-eksoottiset-kivet.html",
  "quests": "fi_type",
  "category": "peninsula",
  "description": "Isoisänniemi is a cape located in Helsinki. It is known for the Isoisänsilta bridge (\"Grandfather's Bridge\") which is named after it. The bridge connects the mainland area of Kalasatama to the island of Mustikkamaa, and further to Korkeasaari and Kulosaari. Isoisänsilta is a pedestrian and cycling bridge which opened in 2016. The bridge is about 170 meters long.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57a"
  },
  "name": "Mustikkamaa Beach",
  "coordinates": {
    "lat": 60.178946,
    "lon": 24.99266
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/mustikkamaan-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Mustikkamaa Beach is a popular sandy beach located on the island of Mustikkamaa in Helsinki. It's about a half-hour walk from the Kalasatama and Kulosaari metro stations, accessible via bridges. Lifeguards supervise the beach during the summer. The beach offers amenities such as dressing rooms, showers, toilets, and a kiosk. There are also fitness equipment and a playground nearby. The water quality and temperature are monitored during the summer. Mustikkamaa itself is a recreational area with walking paths, and connections to Korkeasaari Zoo.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57b"
  },
  "name": "Kotikallio",
  "coordinates": {
    "lat": 60.160119,
    "lon": 24.894393
  },
  "url": "",
  "quests": "fi_type",
  "category": "beach",
  "description": "Kotikallio appears to be the name of multiple locations in Helsinki.\n\nOne Kotikallio is Rinnekodit Kotikallio, a nursing home located in Pitäjänmäki, Helsinki, at Kyläkirkontie 6-10. It specializes in 24/7 care for elderly residents, particularly those with memory disorders, with a capacity of 23 residents. The facility aims to create a safe and supportive environment where individual needs are met.\n\nAnother Kotikallio is a daycare center located at Saarenkatu 4, 00550 Helsinki. The daycare center provides meals and pre-primary education in Finnish. A senior citizen's building is located in Kotikallio at Kyläkirkontie 6-10.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57c"
  },
  "name": "Itälahti",
  "coordinates": {
    "lat": 60.145894,
    "lon": 24.880137
  },
  "url": "",
  "quests": "fi_type",
  "category": "bay",
  "description": "Itälahti can refer to a few different places in Finland. In Helsinki, Itälahti is located in Lauttasaari. Veijarivuoren puisto, a winter swimming spot, is located in Itälahti, Helsinki. Humaus ry, a winter swimming club, is also located there. In Espoo, Kiinteistö Oy Itälahti is a real estate company. Further away from Helsinki, in Enonkoski, there is Holiday Home Itälahti by Interhome and a cottage called Itälahti, near lake Saimaa. It is a charming log cabin that offers a perfect vacation spot. Itälahti is also a locality in Valtimo, North Karelia.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57d"
  },
  "name": "Kokkokallio",
  "coordinates": {
    "lat": 60.144339,
    "lon": 24.877709
  },
  "url": "",
  "quests": "fi_type",
  "category": "cliff",
  "description": "Kokkokallio is an area located in Helsinki, Espoo and Vantaa, with Kokkokalliontie being a street name found in Helsinki (Pitäjänmäki, Konala) and Vantaa. Kokkokallio in Helsinki is a residential area with apartment buildings, including Asunto Oy Helsingin Kokkokallionkoti. There is a playground called Leikkipaikka Kokkokallio in Helsinki. Kokkokallio in Espoo also refers to a public transportation stop. In Vantaa, Asunto Oy Vantaan Kokkokallio is an apartment building completed in 2020. Apartments in Kokkokallio are located close to services like shops, libraries, schools and public transportation. The area offers green spaces and sports facilities.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57e"
  },
  "name": "Lemissaari",
  "coordinates": {
    "lat": 60.164277,
    "lon": 24.873337
  },
  "url": "https://www.lauttasaari.fi/saariopas/luonto/",
  "quests": "fi_type",
  "category": "sight",
  "description": "Lemissaari is located in Helsinki, specifically in Lauttasaari. It's a cape that extends northward from Lauttasaari. Nowadays, it is connected to the main island through landfill. The area has valuable natural features, including shorelines rich in flora and fauna. It also has a mylonite fault in amphibolite. Lemissaari is also mentioned in the context of traffic routes and planning, with the Lemissaari junction remaining in use even with the construction of the new Koivusaari junction.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c57f"
  },
  "name": "Eira’s sea buckthorn",
  "coordinates": {
    "lat": 60.153733,
    "lon": 24.940979
  },
  "url": "https://www.tripadvisor.fr/LocationPhotoDirectLink-g189934-d23476790-i490327742-Meripuisto-Helsinki_Uusimaa.html",
  "quests": "fi_type",
  "category": "park",
  "description": "Eira's sea buckthorn (Eiran tyrni) is located in Helsinki, in Eira, on the shore of Merisatama, opposite the island of Sirpalesaari. It is an exceptionally tree-like sea buckthorn, usually known as a thorny shrub. The sea buckthorn is known for its healthy berries containing a lot of vitamin C. Typically, sea buckthorns grow to be about 0.5 to 3 meters tall, but this particular one measures about 7 meters, with a trunk circumference of 110 cm. It has been protected since 1999. Once it grew straight up, but over time it has bent towards the sea.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c580"
  },
  "name": "Laukkaniemi Park",
  "coordinates": {
    "lat": 60.169422,
    "lon": 24.85945
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Laukkaniemi Park is located in Lauttasaari, Helsinki. Situated at the end of a road, it offers a peaceful environment close to the sea and nature. A pedestrian bridge from the park connects to Kaskisaari, and further to Mustasaari or Lehtisaari. The park is also conveniently located near Lauttasaari Sports Park and the Koivusaari metro station. It's a good place for people who appreciate quick access to the city center but prefer a quieter residential area surrounded by nature.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c581"
  },
  "name": "Itämetsä",
  "coordinates": {
    "lat": 60.171052,
    "lon": 24.822654
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Itämetsä is a forest located in the Tapiola district of Espoo, acting as a buffer zone between the Länsiväylä highway and residential areas. Minor logging has been carried out to promote forest regeneration, and pine trees were planted along the highway border in 2001. The area features smoothed bedrock from the ice age, around 10,000 years ago, with potash feldspar giving the rock a pink tone. Old initials engraved in the rock date back to 1839. There is also a bus stop with the same name in Tapiola, Espoo.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c582"
  },
  "name": "Licketisaari",
  "coordinates": {
    "lat": 60.186657,
    "lon": 24.881674
  },
  "url": "",
  "quests": "fi_type",
  "category": "island",
  "description": "Licketisaari is a small, rocky island near Seurasaari in Helsinki. When crossing the bridge to Seurasaari, Licketisaari is visible. It is one of the many islands in the Helsinki archipelago. These islands consist of rocky terrain. Helsinki has over 300 islands, many reachable by ferry. They are known for forests or sandy beaches, perfect for experiencing Finnish nature. Suomenlinna is another island with wooden houses, historical buildings and a fortress.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c583"
  },
  "name": "Meilahti Cliffs",
  "coordinates": {
    "lat": 60.187798,
    "lon": 24.893999
  },
  "url": "",
  "quests": "fi_type",
  "category": "cliff",
  "description": "Meilahti Cliffs, located along Paciuksenkatu near Meilahti Sports Park in Helsinki, offer stunning views towards Humallahti and Seurasaarenselkä. Historically, the area was a popular swimming and water park location. The cliffs are known for their beautiful sunsets. The foundations of the former swimming pool can still be seen on the rocks, telling a story of a beloved outdoor swimming area. The area is a popular recreational spot, and there have been discussions about building a bike lane with seating terraces and docks in the area, but these plans have faced some controversy.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c584"
  },
  "name": "Humallahti Cliffs",
  "coordinates": {
    "lat": 60.18645,
    "lon": 24.904067
  },
  "url": "https://fi.wikipedia.org/wiki/Humallahti",
  "quests": "fi_type",
  "category": "cliff",
  "description": "Humallahti Cliffs are located in Meilahti, Helsinki, offering exceptional sea views, making them a perfect spot for sunny days, picnics, or enjoying the sunset. The cliffs are near Humallahti park, on the eastern shore of the Humallahti bay. Nearby, you'll find a 3000-year-old Bronze Age burial cairn, indicating the area's historical significance. Humallahti has served as a swimming spot since 1898, featuring a swimming pool from 1919 to 1959. In 1930s workers discovered the frame of an old warship. Bus 24 will take you near Humallahti Cliffs.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c585"
  },
  "name": "Kaivoskallion luonnonsuojelualue",
  "coordinates": {
    "lat": 60.170944,
    "lon": 25.025924
  },
  "url": "https://www.helsinkikuvia.fi/search/details/?image_id=hkm.6ec15398-0ea2-4871-a3fb-1cde3b498c13",
  "quests": "fi_type",
  "category": "nature_reserve",
  "description": "Kaivoskallio Nature Reserve is located in eastern Helsinki, in the western part of Laajasalo. Specifically, it's situated near the intersection of Koirasaarentie and Stansvikintie. On maps, the location is marked as Kaivoskallio. The area is 5.44 hectares in size and owned by the city of Helsinki.\n\nThe area has a history of iron ore and limestone mining, with mining shafts still visible. Kaivoskallio is considered a valuable natural site locally, featuring deciduous trees, valuable grove plants and a rich variety of mosses on its steep slopes. The area also includes the Stansvik manor area.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c586"
  },
  "name": "Korkeasaarenluoto",
  "coordinates": {
    "lat": 60.174214,
    "lon": 24.978054
  },
  "url": "https://www.hel.fi/fi/kaupunkiymparisto-ja-liikenne/ympariston-ja-luonnon-suojelu/luonnonsuojelu-ja-monimuotoisuus/helsingin-luonnonsuojelualueet",
  "quests": "fi_type",
  "category": "islet",
  "description": "Korkeasaarenluoto is a small island located in Helsinki, specifically at coordinates 60°10'N 24°59'E. It is situated approximately 3 km northeast of a harbor project area. It's also known by its Swedish name, Högholmen. The island covers an area of about 0.22 square kilometers. Korkeasaarenluoto is relatively flat, measuring about 0.7 km from north to south and 0.6 km from east to west. The island is known for its valuable archipelago birdlife and vegetation, leading to its proposed protection. It is near Korkeasaari Zoo."
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c587"
  },
  "name": "Mustikkamaa Cliffs",
  "coordinates": {
    "lat": 60.182969,
    "lon": 24.988282
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/ulkoilualueet/mustikkamaa",
  "quests": "fi_type",
  "category": "cliff",
  "description": "Mustikkamaa, or Blueberry Land, is a popular recreational island near Helsinki, easily accessible via the Isoisänsilta bridge. The island features jogging tracks, beaches, and forests. The \"Mustikkamaan kalliot\" (Mustikkamaa cliffs) are located on the northern side of the island. These cliffs are a favored spot during summer for picnics and enjoying the warmth. Mustikkamaa offers various activities like swimming, with sandy beaches equipped with amenities. You can also find the Korkee adventure park for climbing, a summer theatre, and an edible garden. The island is known for its scenic views and provides a peaceful natural environment.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c588"
  },
  "name": "Pihlajasaaren Naturistiranta",
  "coordinates": {
    "lat": 60.138431,
    "lon": 24.921153
  },
  "url": "",
  "quests": "fi_type",
  "category": "beach",
  "description": "Pihlajasaaren Naturistiranta is a naturist beach located on the island of Pihlajasaari, near Helsinki. It's a unisex beach, open to both men and women. Unlike the sandy beaches on the main part of the island, the naturist area features mostly bare cliffs, making it somewhat rocky. It offers a secluded and liberating experience for those who enjoy clothing-optional sunbathing and recreation. The island is accessible by a water bus that operates during the summertime, making it a popular destination for a unique beach experience.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c589"
  },
  "name": "Pihlajasaari Beach",
  "coordinates": {
    "lat": 60.140136,
    "lon": 24.913359
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/pihlajasaaren-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Pihlajasaari beach is located on an island in Helsinki, accessible by ferry from Kaivopuisto or Ruoholahti. It's a popular summer destination known for its sandy beaches, rocky shores and old villas. The island offers a diverse landscape with wooded areas and groves, making it a versatile outdoor recreation area. Besides the regular beach, there is also a naturist beach. The sandy beach is perfect for families, featuring a kiosk and playground, while other parts of the shore are suitable for swimming as well. You can also find cooking shelters, saunas, and a restaurant on the island.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58a"
  },
  "name": "Porvariskuninkaan uimaranta",
  "coordinates": {
    "lat": 60.159592,
    "lon": 25.087822
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/porvariskuninkaanpuiston-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Porvariskuninkaan uimaranta is a sandy beach located in Jollas, East Helsinki. It's about 13 kilometers from the city center. This sheltered beach has soft sand and is surrounded by trees, making it a peaceful spot. There are changing rooms available, and public transportation can be used to reach the beach. The beach isn't supervised by lifeguards during the swimming season. It's considered a quiet beach, not usually crowded even on hot summer days. The address is Kuninkaansormuksenpolku 8, 00850 Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58b"
  },
  "name": "Tuorinniemi beach",
  "coordinates": {
    "lat": 60.185963,
    "lon": 25.038678
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/tuorinniemen-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Tuorinniemi beach is a sandy beach located in Herttoniemi, Helsinki, just south of Herttoniemenranta. It's known for its gently sloping shoreline, making it a family-friendly spot. The water deepens evenly, but note that the eastern end gets deeper more quickly. During the summer, lifeguards are present. The beach provides amenities such as dressing rooms, showers, and toilets. There's also a playground for children and outdoor gym equipment. While there isn't a parking lot right by the beach, it's accessible by public transport or city bikes. A light traffic route for watercraft is also available.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58c"
  },
  "name": "Meri-Rastilan uimaranta",
  "coordinates": {
    "lat": 60.198313,
    "lon": 25.131229
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/rastilan-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Meri-Rastilan uimaranta is a sandy beach in Helsinki, ideal for a relaxing day enjoying nature. It is considered one of the best free things to do in Helsinki and is popular with families. The beach offers clear waters for swimming and a picturesque atmosphere. Meri-Rastila is located in eastern Helsinki, near the Rastila metro station and a camping site. The surrounding area features hiking trails, forest paths, and nature reserves, making it easy to explore. The city is committed to keeping the beach natural and is improving the coastal route for accessibility.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58d"
  },
  "name": "Hietaranta Beach",
  "coordinates": {
    "lat": 60.173932,
    "lon": 24.906107
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/hietarannan-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Hietaranta Beach, also known as \"Hietsu\", is a popular sandy beach in the Töölö district of Helsinki. It's a well-loved summer spot for sunbathers and beach volleyball players. There is a beach volley community, and courts are available for public use. The beach has a renovated pavilion from 1930, which now hosts concerts and cultural events. You can find a cafe and terrace there that are open all year round. During the summer, the beach is monitored for blue-green algae and water temperature. Hietaranta has been a popular beach since the 1930s and is easily accessible from the city center.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58e"
  },
  "name": "Lehtisaari Swimming Beach",
  "coordinates": {
    "lat": 60.174674,
    "lon": 24.850458
  },
  "url": "https://uimaranta.com/lehtisaaren/",
  "quests": "fi_type",
  "category": "beach",
  "description": "Lehtisaari Swimming Beach is a small, local beach in western Helsinki. While not very large, it's appreciated by residents. From the beach, you can admire the views of Espoo's Keilaniemi, known for its business district. The area is peaceful and offers a relaxing swimming experience close to the city. There is free parking near the beach. It can be considered as a hidden gem offering a calm experience in the heart of the city.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c58f"
  },
  "name": "Pikkukoski Swimming Beach",
  "coordinates": {
    "lat": 60.227841,
    "lon": 24.983256
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/pikkukosken-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Pikkukoski Swimming Beach is a popular sandy beach located in Oulunkylä, Helsinki, along the Vantaanjoki River. It's easily accessible by public transport, approximately a 20-minute walk from the Oulunkylä train station. The beach features a sandy area and large grassy lawns, perfect for sunbathing and games. The water deepens quickly, and currents may be strong. Lifeguards supervise the beach during the summer season.\n\nPikkukoski offers diverse facilities including dressing rooms, showers, toilets, and a sauna with free sauna hours on Wednesdays and Saturdays. Sports enthusiasts can enjoy a basketball court, beach volleyball court, outdoor gym, and exercise area. Water quality is regularly tested, and results are posted. Despite being a popular spot, it offers a peaceful escape with trails through the surrounding forests.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c590"
  },
  "name": "Eiran ranta",
  "coordinates": {
    "lat": 60.154695,
    "lon": 24.935281
  },
  "url": "https://fi.wikipedia.org/wiki/Eiranranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Eiranranta is a street and a beach in southern Helsinki, located in the districts of Eira and Hernesaari. The beach is not an official swimming beach maintained by the city, so there is no lifeguard supervision or water quality testing. However, it's still a popular spot for sunbathing, picnics, and enjoying the seaside atmosphere. The area boasts beautiful scenery and is close to the Kaivopuisto park, cafes, and harbors with connections to nearby islands. The street, Eiranranta, is about half a kilometer long and offers parking, pedestrian walkways and a bicycle path.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c591"
  },
  "name": "Toppelundin Ranta",
  "coordinates": {
    "lat": 60.15595,
    "lon": 24.787685
  },
  "url": "https://www.espoo.fi/fi/toimipisteet/toppelundin-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Toppelundin Ranta is a beach located in Haukilahdessa, Espoo, near Helsinki. It is actually a series of beaches. The main beach is quite small, but it offers amenities such as toilets, changing rooms, and a café, as well as a shower. A breakwater is a prominent feature. There is also a dog beach nearby. The area is popular for surfing.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c592"
  },
  "name": "Tapaninvainion uimaranta",
  "coordinates": {
    "lat": 60.257048,
    "lon": 24.977022
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/tapaninvainion-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Tapaninvainion uimaranta is a popular beach in Helsinki, located along the Vantaanjoki river. The beach has soft sand and the sign warns of sudden depth in the water. The city renovates the beach every year by adding sand. In addition to swimming, there is an outdoor gym with fitness equipment, including bars and a volleyball court. There is also a canoe rental service just north of the beach. The beach has a history as a gathering place, with the local neighborhood association organizing events such as beach parties.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c593"
  },
  "name": "Jupperinranta",
  "coordinates": {
    "lat": 60.258209,
    "lon": 24.760195
  },
  "url": "https://www.hagerlund.net/fi/jupperinranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Jupperinranta is a neighborhood in Espoo, located in the Helsinki sub-region of Uusimaa. It is near the locality of Juvanranta and the neighborhood of Pitkäjärvenranta. Jupperinranta also has a beach by Lake Pitkäjärvi which is a small, beautiful, and popular spot during sunny summer days. The Jupperi Homeowners' Association manages the beach. There is also a \"surfing beach\" in Jupperi. The beach faces northwest, offering lovely evening sunlight. Services include a changing room, outhouse, and dock.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c594"
  },
  "name": "Pitkäjärvi",
  "coordinates": {
    "lat": 60.250612,
    "lon": 24.735339
  },
  "url": "https://fi.wikipedia.org/wiki/Pitk%C3%A4j%C3%A4rvi_(Espoo)",
  "quests": "fi_type",
  "category": "lake",
  "description": "Pitkäjärvi is a lake located mainly in Espoo, to the southeast of Kehä III, between Turuntie and Vihdintie. A small part of the northeastern section of the lake is located in Vantaa. It's also known as Espoon Pitkäjärvi or Vanhankylän Pitkäjärvi. The lake is shallow, with an average depth of 2.3 meters and a maximum depth of 5.6 meters. The lake's length from northeast to southwest is about 4.9 kilometers. There is also a winter swimming spot at Laaksolahti beach by Pitkäjärvi. In Nuuksio National Park, there is also another lake called Pitkäjärvi.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c595"
  },
  "name": "Lake Bodom Beach",
  "coordinates": {
    "lat": 60.24117,
    "lon": 24.659914
  },
  "url": "https://www.espoo.fi/fi/toimipisteet/oittaan-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Lake Bodom Beach, also known as Oittaa Beach, is located on Lake Bodom in Espoo, near Helsinki. It's a popular sandy beach, especially among families with children, due to its gradually deepening waters. Oittaa offers two separate beach areas. The recreational area has services such as showers, changing rooms, a café-restaurant, and even saunas that are open in winter for ice swimming. There are also facilities for beach volleyball, an Angry Birds playground, and outdoor gym equipment. You can also rent equipment for water sports. The area has walking paths, nature trails, and in winter, ski tracks, offering year-round activities.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c596"
  },
  "name": "Stansvik Beach",
  "coordinates": {
    "lat": 60.162592,
    "lon": 25.028601
  },
  "url": "https://loci.fi/fi/works/details/stansvikinrannan-uimaranta/",
  "quests": "fi_type",
  "category": "beach",
  "description": "Stansvik Beach is located in the Kruunuvuorenranta district of Laajasalo, Helsinki. The beach is near the Stansvik Manor area, known for its beautiful manor and park. The beach is relatively small and is next to Restaurant Stansvik, which offers sea views from its terrace. Stansvik beach is planned to be Helsinki's first accessible beach. In 2019-2020, sand was brought from Porvoo to create a swimming beach around 400 meters long. At Stansvik, visitors can swim, dine at the restaurant, and explore the unique natural surroundings. The Stansvik Manor area has 14 buildings, including a restaurant and a beach sauna.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c597"
  },
  "name": "Hevossalmi Beach",
  "coordinates": {
    "lat": 60.162453,
    "lon": 25.041134
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/hevossalmen-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Hevossalmi Beach is located in Laajasalo, Helsinki. It is a diverse beach with both sandy and rocky areas, offering scenic views of the archipelago. The beach provides basic amenities like changing rooms, toilets, and a playground. Lifeguard supervision is not available during the swimming season. To reach the beach, public transportation is recommended as there is no dedicated parking area nearby. You can check the water quality and temperature online. The address is Vuorilahdenpolku 6, 00870 Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c598"
  },
  "name": "Tullisaari Beach",
  "coordinates": {
    "lat": 60.177463,
    "lon": 25.021246
  },
  "url": "https://www.stadissa.fi/paikat/1779/tullisaari",
  "quests": "fi_type",
  "category": "beach",
  "description": "Tullisaari Beach is located in Helsinki, near the beautiful Tullisaari park. It is a sheltered, sandy beach surrounded by cliffs, making it a peaceful spot popular with families and those seeking tranquility. The nearby cliffs showcase stunning formations sculpted by the Ice Age. In the western part of the park, there's a large lawn suitable for games, a playground, pretty forests, and shoreline paths. From this area, you can walk to Pyysaari, home to the Helsinki Workers' Yacht Club, where you can find restaurants.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c599"
  },
  "name": "Tervasaari Beach",
  "coordinates": {
    "lat": 60.173364,
    "lon": 24.968898
  },
  "url": "https://sandee.com/finland/uusimaa/helsinki/tervasaaren-uimaranta--tervasaari-beach",
  "quests": "fi_type",
  "category": "beach",
  "description": "Tervasaari is an island in Helsinki, connected to the mainland by a causeway, and is a popular recreational area. It's named \"Tar Island\" because it once stored tar for export. Tervasaari has a playground, a dog park with a swimming area for dogs, a summer theatre, and a rug washing pier. In summertime you can find roses. There is a restaurant located in the last remaining storehouse which dates back to 1805. It's a nice place to enjoy fresh sea breezes and city views.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59a"
  },
  "name": "Kivinokka Beach",
  "coordinates": {
    "lat": 60.194723,
    "lon": 25.005427
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/uimarannat/helsingin-uimarannat/kivinokan-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Kivinokka beach is located in Helsinki, near the Kulosaari and Herttoniemi metro stations. It's known as a sandy-bottomed beach suitable for families. Kivinokka is a popular recreational area where city dwellers enjoy nature. There are actually two beaches, the main one and a smaller, quieter \"sunset beach\" which is next to the dog beach. The area has a nature trail, woodlands, a summer café, a mansion, summer huts and an allotment garden. It's a historically significant place with cultural value. Services include changing rooms, showers, and toilets. Kivinokka also hosts events, like the KinoKivinokka film festival.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59b"
  },
  "name": "Suvisaaristo Beach",
  "coordinates": {
    "lat": 60.124594,
    "lon": 24.707099
  },
  "url": "https://www.espoo.fi/fi/toimipisteet/suvisaaristo-svinon-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Suvisaaristo Beach, also known as Svinö beach, is located in Espoo, near Helsinki. It's a small, peaceful beach with an archipelago atmosphere, a bit tricky to find but rewarding in its tranquility. The beach offers basic amenities like changing rooms and a dock. There isn't a toilet at the beach. A beach volleyball court is located near the parking area on Suvisaarentie road. The beach is accessible via a winding forest path, and public transportation is available nearby.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59c"
  },
  "name": "Westend beach",
  "coordinates": {
    "lat": 60.168447,
    "lon": 24.809823
  },
  "url": "https://www.espoo.fi/fi/toimipisteet/westendin-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Westend beach is located in Espoo, near Helsinki. More specifically, it lies in southern Espoo, approximately 4-5 kilometers from the Helsinki city center. The beach offers a variety of amenities, including changing rooms, showers, and toilet facilities. For recreation, there is a playground and fitness equipment available. A special feature of Westend beach is its peninsula with a pier, perfect for jumping into the sea. The beach is conveniently located next to Tapiola and offers a blend of urban accessibility and peaceful surroundings. It has a shallow sandy area suitable for children and deeper water accessible from the dock.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59d"
  },
  "name": "Vaaralan Riviera",
  "coordinates": {
    "lat": 60.259131,
    "lon": 25.087915
  },
  "url": "",
  "quests": "fi_type",
  "category": "beach",
  "description": "Vaaralan Riviera is a locality in Vantaa, near Helsinki. It's located in the Vaarala district, bordering Helsinki's Jakomäki. It's known for the Vaaralanlammet ponds and the Slåttmossen swamp. The area is primarily a recreational zone, with plans to develop the ponds into a swimming area with facilities. The district also aims to protect the biodiversity of the Slåttmossen swamp. It lies between residential and industrial areas of Vaarala and the Porvoo highway. There are plans to develop the area gradually, including waste management improvements, dressing rooms and water quality control.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59e"
  },
  "name": "Rekola",
  "coordinates": {
    "lat": 60.330227,
    "lon": 25.072829
  },
  "url": "https://fi.wikipedia.org/wiki/Rekolan_historia",
  "quests": "fi_type",
  "category": "neighborhood",
  "description": "Rekola is a district in the city of Vantaa, Finland, located approximately 20 kilometers from Helsinki. It is served by the Rekola railway station, a Helsinki commuter rail station on the Helsinki–Riihimäki railway line. The station is served by K-line trains to Kerava and T-line trains to Riihimäki and Helsinki. Additionally, Rekola is home to Rekola Farm, a biodynamically managed farm. There is also a company named Rekola that designs and manufactures cleaning trolleys and accessories. The Lutheran Rekola parish is also located in Vantaa.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c59f"
  },
  "name": "Gallträsk Swimming Pier",
  "coordinates": {
    "lat": 60.218788,
    "lon": 24.72833
  },
  "url": "https://www.kauniainen.fi/asuminen-ja-ymparisto/ymparisto/luonto/galltrask/",
  "quests": "fi_type",
  "category": "beach",
  "description": "The Gallträsk swimming pier is located on Lake Gallträsk in Kauniainen, near Helsinki. The lake is shallow, with a maximum depth of about 1.5 meters. A public path surrounds the lake, and the pier provides access to the water for swimming. The pier has stairs for easy entry and exit. Gallträsk used to be a popular swimming spot in the early 1900s, even drawing visitors from Helsinki. However, the lake became polluted with wastewater. In recent years, efforts have been made to clean the lake, and its condition has improved significantly. There is also a playground near the swimming pier. In winter, an ice skating track is created on the lake.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a0"
  },
  "name": "Vilniemi Beach",
  "coordinates": {
    "lat": 60.234067,
    "lon": 24.727877
  },
  "url": "https://www.hagerlund.net/fi/vilniemen-ranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Vilniemi Beach is located in central Espoo, on the western shore of Lake Lippajärvi. It's a small, well-maintained sandy beach with a gradual slope into the water. From the beach, you can see the opposite shore of Lippajärvi. The beach is maintained by the Lippajärveläiset Association. Vilniemi Beach also features a beach volleyball court that is freely accessible, with net posts and a net available. For those looking to combine a sauna with a swim, it's conveniently located near residential areas, making a quick dip in the lake after a sauna easily accessible.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a1"
  },
  "name": "Suomenlinna Sea Fortress",
  "coordinates": {
    "lat": 60.147903,
    "lon": 24.9863
  },
  "url": "https://fi.wikipedia.org/wiki/Suomenlinna",
  "quests": "fi_type",
  "category": "fortification",
  "description": "Suomenlinna is a sea fortress located off the coast of Helsinki, accessible by a short ferry ride from the city center. It is a UNESCO World Heritage Site and a popular tourist destination. Construction began in 1748, and it has served in the defense of Sweden, Russia, and Finland. Today, Suomenlinna is a vibrant district with around 800 residents. It features museums, guided tours, restaurants, and offers events throughout the year. With its walls, cannons, tunnels and parks, it provides a unique blend of history and natural beauty.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a2"
  },
  "name": "Kustaanmiekka Fortification",
  "coordinates": {
    "lat": 60.13804529999999,
    "lon": 24.9903256
  },
  "url": "https://fi.wikipedia.org/wiki/Kustaanmiekka",
  "quests": "fi_type",
  "category": "island",
  "description": "Kustaanmiekka is the southernmost of the eight islands that constitute the Suomenlinna district in Helsinki. It is a significant part of the Suomenlinna fortress, featuring the King's Gate. The island is named in honor of the birth of the Swedish Crown Prince Kustaa, during the construction of the Suomenlinna fortress. The government decided to preserve Kustaanmiekka as a historical monument already in 1919. Kustaanmiekka is also the name of the 81-meter-wide strait between Kustaanmiekka and Vallisaari. The strait is considered one of the trickiest places on the Finnish coast, with an S-curve that has caused accidents.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a3"
  },
  "name": "King’s Gate",
  "coordinates": {
    "lat": 60.13959490000001,
    "lon": 24.9899497
  },
  "url": "https://www.suomenlinna.fi/en/visitor/sights/kings-gate/",
  "quests": "fi_type",
  "category": "fortification",
  "description": "King's Gate (Kuninkaanportti in Finnish) is the main symbol of Suomenlinna fortress, located just outside of Helsinki. It was constructed in 1753-54 at the place where King Adolf Frederick of Sweden anchored his ship when inspecting the fortress construction. The name \"King's Gate\" originates from this event. The gate is a classic fortress entrance, complete with cannon openings. Wide stairs lead up to the gate, which features a drawbridge and a pit on either side to prevent climbing. The gate's sides are adorned with stone tablets inscribed by Augustin Ehrensvärd.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a4"
  },
  "name": "Gyllenborg Bastion",
  "coordinates": {
    "lat": 60.13994409999999,
    "lon": 24.9873901
  },
  "url": "https://voicemap.me/tour/helsinki/suomenlinna-walking-tour-a-guide-to-helsinki-s-island-fortress/sites/bastion-carpelan-and-bastion-gyllenborg",
  "quests": "fi_type",
  "category": "fortification",
  "description": "Gyllenborg Bastion is located in Suomenlinna, Helsinki, on the island of Kustaanmiekka. It's part of the fortress chain in Suomenlinna. The bastion, along with Carpelan, was constructed between 1748 and 1750, utilizing natural rock walls in its design. A brick officer's building was added to the firing platform between 1769 and 1771. Later, a battery (2/E26–E27) was built on top of Gyllenborg Bastion. It was renovated in 1877–79 and rebuilt in the late 1880s with reinforced stone walls and renovated earthworks. During cable work in 2016, one excavation was made on the bastion, near Patteri 1, which was built on it during the Russian era. Today, the area is a part of the Suomenlinna World Heritage Site.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a5"
  },
  "name": "De Carnal Caponier",
  "coordinates": {
    "lat": 60.14320469999999,
    "lon": 24.9869802
  },
  "url": "https://fi.wikipedia.org/wiki/Luettelo_Suomenlinnan_rakennuksista",
  "quests": "fi_type",
  "category": "fortification",
  "description": "De Carnal Caponier is a defensive structure located in Suomenlinna, Helsinki. Suomenlinna is a sea fortress and a district of Helsinki, located about 15 minutes from the city center. It is a UNESCO World Heritage Site and a popular tourist destination.\n\nA caponier is a type of fortification that projects into a ditch to provide flanking fire. It originates from the French word \"caponnière,\" meaning \"chicken coop.\" In bastioned forts, caponiers often took the form of low, open passages that projected outward into the ditch, providing access to outworks and protecting troops. Later designs were roofed and used to defend against besiegers.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a6"
  },
  "name": "Alexander Battery",
  "coordinates": {
    "lat": 60.1348586,
    "lon": 24.999163
  },
  "url": "https://vallisaari.fi/en_US/aleksanterinpatteri",
  "quests": "fi_type",
  "category": "fortification",
  "description": "The Alexander Battery is a formidable artillery battery located in Vallisaari, an island near Helsinki. Built by the Russian military in the mid-19th century following the Crimean War, it was intended to demonstrate Russia's military strength and secure the sea approaches to St. Petersburg. The battery, named after the Tsar, is situated at the highest point of Vallisaari, offering panoramic views. Originally, it had casemates for cannons and gunpowder storage. Later, the cannons were moved to the roof, and the casemates were converted into crew quarters. Vallisaari is open for visitors, but access inside the Alexander Battery might require special permission."
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a7"
  },
  "name": "Kuninkaansaari Fortress",
  "coordinates": {
    "lat": 60.1339506,
    "lon": 25.0205265
  },
  "url": "https://www.kuninkaansaari.fi/",
  "quests": "fi_type",
  "category": "fortification",
  "description": "Kuninkaansaari Fortress, also known as King's Island, is located near Helsinki, next to Suomenlinna. It's accessible by a 20-minute boat trip from the Market Square. Historically, it served as a naval base for the Swedish King Gustav III in the late 18th century and was later fortified by Russia in the 19th century. In the early 20th century, it was a significant part of the Viapori fortress.\n\nToday, Kuninkaansaari is open to the public, offering marked trails for exploration due to remaining explosives from past conflicts. Visitors can see artillery batteries, gunpowder cellars, and a water pumping system. The island is renowned for its untouched nature, diverse flora and fauna and provides scenic views of the sea and Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a8"
  },
  "name": "Korkeakallio park",
  "coordinates": {
    "lat": 60.218855,
    "lon": 25.0671094
  },
  "url": "https://vihreatsylit.fi/korkeakallionpuisto/",
  "quests": "fi_type",
  "category": "park",
  "description": "Korkeakallio Park is a forested park area located in Myllypuro, Helsinki. It's known for its historical significance as the site of artillery battery 65, which was part of Helsinki's earth fortifications built during World War I to protect St. Petersburg. The park features concrete structures, trenches, and bunkers that resemble a movie set, offering a glimpse into the past. Renovations have been carried out to uncover and enhance the appearance of the fortifications. It's a popular outdoor recreation area where visitors can explore the historical remnants and enjoy nature. The park also has White Adders-Mouth orchids and Awnless Brome flourishing in the marshy areas.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5a9"
  },
  "name": "Kaarela Fortification",
  "coordinates": {
    "lat": 60.2360272,
    "lon": 24.8958373
  },
  "url": "",
  "quests": "fi_type",
  "category": "fortification",
  "description": "The Kaarela Fortification is part of the Krepost Sveaborg, a World War I-era defense system built around Helsinki. It was constructed to protect the Gulf of Finland, Helsinki, and to block access to St. Petersburg in case of a German invasion. The central point of Krepost Sveaborg was Suomenlinna fortress. The fortification consisted of land and coastal artillery, with concrete trenches and shelters. Today, the remains of the Kaarela Fortification can be found in areas like Maununneva, with some trenches and ramparts still visible in the forests. While not always in the best condition, these remnants offer a glimpse into Helsinki's early 20th-century military history.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5aa"
  },
  "name": "Koskela Fortress",
  "coordinates": {
    "lat": 60.22369,
    "lon": 24.978831
  },
  "url": "",
  "quests": "fi_type",
  "category": "fortification",
  "description": "The Koskela Fortress is part of the Krepost Sveaborg, a World War I-era fortification system surrounding Helsinki. Constructed in the 1910s, it formed part of the land defenses of Helsinki, intended to protect the city and naval base. The fortress included field fortifications built in 1914 and more permanent structures erected later. In Koskela, there were artillery batteries. Today, the area features remnants of these fortifications, including gun emplacements (some flooded and fenced off), cave systems, and a deep trench where a planned cave was never finished. Some areas are sealed off. The city has installed information boards to explain the history of the area.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ab"
  },
  "name": "Torpparinmäki Fortress Area",
  "coordinates": {
    "lat": 60.259421,
    "lon": 24.9502807
  },
  "url": "",
  "quests": "fi_type",
  "category": "fortification",
  "description": "Torpparinmäki Fortress Area is part of the Krepost Sveaborg, a series of fortifications around Helsinki. Construction of the fortifications in the Torpparinmäki, Paloheinä and Itä-Pakila area (Support Point XVI) began in 1915. The armament of the remaining battery 83 consisted of two 152 mm Canet cannons. Many of the remaining positions have been partially or almost completely filled. One of the caves in the area is used as a warehouse. The area also includes Lystikukkula, an old fortress area with old, natural-like forest. The area is home to many bat species.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ac"
  },
  "name": "World War I Fortress",
  "coordinates": {
    "lat": 60.2503063,
    "lon": 25.074697
  },
  "url": "https://www.rky.fi/read/asp/r_kohde_det.aspx?KOHDE_ID=1570",
  "quests": "fi_type",
  "category": "fortification",
  "description": "During World War I, Helsinki was surrounded by a series of fortifications, known as Krepost Sveaborg, to protect the then-Russian capital, St. Petersburg, from a potential German invasion through Finland. The fortress included both land and sea defenses. Fortifications were constructed on islands off the coast and on land, forming multiple lines of defense around the city. Suomenlinna (Viapori), a historic sea fortress, served as a key part of this defense system. The land fortifications consisted of trenches, concrete structures and artillery positions, spread across what is now Helsinki and neighboring cities like Espoo and Vantaa. Today, remnants of these fortifications can still be seen, offering a glimpse into the military history of the region.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ad"
  },
  "name": "First World War Fortifications in Mustavuori",
  "coordinates": {
    "lat": 60.235933,
    "lon": 25.1429209
  },
  "url": "https://www.myhelsinki.fi/places/mustavuori-nature-reserve-and-fortification/",
  "quests": "fi_type",
  "category": "fortification",
  "description": "The Mustavuori area in Vuosaari, Helsinki, features fortifications from the First World War, which were built by the Russians between 1914 and 1918. These fortifications were part of the Viapori land and sea fortress, designed to protect the sea fortress at Kruunuvuorenselkä and, more broadly, to defend St. Petersburg. Mustavuori was the easternmost part of this defense line. Today, the area includes trenches, caves, and a well-preserved connecting road (tykkitie). Some parts were left unfinished, such as large caves intended for personnel. The fortifications are protected under the antiquities law, and the area is a nationally significant built environment.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ae"
  },
  "name": "Helsinki Observatory",
  "coordinates": {
    "lat": 60.1619366,
    "lon": 24.951589
  },
  "url": "https://fi.wikipedia.org/wiki/Helsingin_yliopiston_Observatorio",
  "quests": "fi_type",
  "category": "observatory",
  "description": "The Helsinki Observatory, completed in 1834, was designed by C.L. Engel and F.W.A. Argelander. It served as a leading astronomy research institute and a model for other observatories. Located on Tähtitorninmäki Hill, it now functions as an astronomy visitor center under the Helsinki University Museum Flame. The observatory's exhibition offers insights into the history of the building and the wonders of space for all ages. It also houses the Ursa Astronomical Association and the University's Almanac Office.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5af"
  },
  "name": "Kaivopuiston tähtitorni",
  "coordinates": {
    "lat": 60.1555237,
    "lon": 24.9554323
  },
  "url": "https://fi.wikipedia.org/wiki/Ursan_t%C3%A4htitorni",
  "quests": "fi_type",
  "category": "observatory",
  "description": "The Kaivopuisto Observatory, completed in 1926, is a prominent landmark located on the highest hill in Kaivopuisto Park in Helsinki. It's operated by the Ursa Astronomical Association. Designed by architect Martti Välikangas, the observatory is actively used by both astronomy enthusiasts and the general public. Public viewings are held, offering observations of the Sun during summer Sundays and celestial objects during winter evenings. The observatory also has a sundial sculpture called Helios in front of it, designed by Lauri Anttila. Besides the historical Merz refractor, the observatory has three other telescopes in use.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b0"
  },
  "name": "Haltiala Domestic Animal Farm",
  "coordinates": {
    "lat": 60.2757361,
    "lon": 24.9535859
  },
  "url": "https://www.hel.fi/en/culture-and-leisure/outdoor-activities-parks-and-nature-destinations/outdoor-recreation-areas/haltiala-farm",
  "quests": "fi_type",
  "category": "farm",
  "description": "Haltiala Domestic Animal Farm, located in Tuomarinkylä, Helsinki, is owned by the City of Helsinki and is a recreational and educational farm for city residents. Its main purpose is to keep the fields cultivated for centuries still in agricultural use. It is a popular destination, especially for families with children, offering a chance to see farm animals like cows, sheep, goats, and chickens. During summer, the animals are outside and can be viewed from morning to evening. In winter, they are mostly indoors, with specific visiting hours. The farm also cultivates traditional crops, peas, and flowers, which city residents can pick for free in summer. Additionally, there's a café-restaurant and a playground on site.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b1"
  },
  "name": "Tikkurila Sheep Pasture",
  "coordinates": {
    "lat": 60.304261,
    "lon": 25.01252
  },
  "url": "",
  "quests": "fi_type",
  "category": "farm",
  "description": "The Tikkurila Sheep Pasture is located in Vantaa, specifically in the Tikkurila Central Park in Koivuhaka and in Hakunila's Kormuniitty. Every summer, sheep graze in these areas to maintain the landscape. The grazing season typically lasts from early summer until early October, or until the pasture runs out of food. Viewing areas are set up near the enclosures, allowing people to observe the sheep. Visitors are allowed to offer fresh grass to the sheep from the viewing areas, but feeding them other food is prohibited to keep the animals healthy and the pastures clean.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b2"
  },
  "name": "Korkeasaari Zoo",
  "coordinates": {
    "lat": 60.1748869,
    "lon": 24.9850408
  },
  "url": "https://fi.wikipedia.org/wiki/Korkeasaari",
  "quests": "fi_type",
  "category": "zoo",
  "description": "Korkeasaari Zoo, also known as Helsinki Zoo, is the largest zoo in Finland and one of the oldest zoos in the world, founded in 1889. It's located on an island near Helsinki's city center. The zoo houses around 150 animal species, primarily European and Asian, selected to thrive in Finland's climate.\n\nDuring summertime, visitors can reach the zoo by ferry or water bus from the Market Square. All year around there is also a bridge that connects to the mainland. Korkeasaari Zoo is a non-profit foundation dedicated to conserving endangered species and biodiversity. They are actively involved in international conservation programs and have a wildlife hospital for injured animals.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b3"
  },
  "name": "Karhulinna",
  "coordinates": {
    "lat": 60.17470299999999,
    "lon": 24.98861519999999
  },
  "url": "https://fi.wikipedia.org/wiki/Korkeasaari",
  "quests": "fi_type",
  "category": "zoo",
  "description": "Karhulinna is not located in Helsinki or its neighboring cities. Karhulinna is located in Rauma. It is a cliff in the district of Merirauma, north of Syväraumanlahti. The place is unknown to many locals. Karhulinna dates back to World War I, when battle trenches were carved into the rock, some as deep as two meters, totaling about 160 meters. The walls are reinforced with cement mortar and wedge stones, and partly with concrete. In the middle of the trenches are two gun emplacements. Shelters are located at both ends of the trenches. The defense is directed towards the west. A good path leads to the site from Järvikatu, where there is also a Karhulinna sign.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b4"
  },
  "name": "Nuuksio Reindeer Park",
  "coordinates": {
    "lat": 60.30429229999999,
    "lon": 24.5515684
  },
  "url": "https://www.myhelsinki.fi/places/nuuksio-reindeer-park/",
  "quests": "fi_type",
  "category": "zoo",
  "description": "Nuuksio Reindeer Park is Finland's southernmost reindeer park, located in Nuuksio, about 30 km from Helsinki. It offers visitors a chance to see reindeer up close and learn about them. The park is open to the public mainly on weekends. The entrance fee includes lichen to feed the reindeer, campfire coffee or tea, and a bun. There is also a souvenir shop. The reindeer arrived from Lapland in 2013, and the park is now home to six reindeer. The park also has a White Reindeer Teepee Restaurant and an amethyst mining shelter. The park is not fully accessible due to the rocky forest terrain.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b5"
  },
  "name": "Seurasaari Pier",
  "coordinates": {
    "lat": 60.18029689999999,
    "lon": 24.8807837
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/ulkoilualueet/seurasaari",
  "quests": "fi_type",
  "category": "pier",
  "description": "Seurasaari has a pier that is connected to the mainland by a bridge since 1892. In the past, the island had a steamship pier. In June 2020, a new guest pier with 12 boat places was opened next to the Seurasaari route pier by the restaurant Seurasaaren Kruunu. The island is a recreational area and is home to the Seurasaari Open-Air Museum, featuring historical Finnish buildings. There is also a beach with a small pier and a red lifebuoy. A ferry service is available from the Market Square to Seurasaari.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b6"
  },
  "name": "Katajanokan mattolaituri",
  "coordinates": {
    "lat": 60.1693448,
    "lon": 24.9759847
  },
  "url": "",
  "quests": "fi_type",
  "category": "pier",
  "description": "Katajanokan mattolaituri is a public carpet washing place located in the Katajanokka district of Helsinki, specifically at Katajanokanranta 21, at the end of Laivastokatu. It is situated by the sea, near the Laivastonpuisto park and close to where icebreakers are often docked. This pier is a popular spot for locals to wash their carpets during the summer months, typically from May to September, and enjoy the sunny weather and company of others. The pier also serves as a social gathering place, where people come to chat, sunbathe, fish, and even hold small celebrations. Stara, the city's public works department, maintains the pier, ensuring it is in good condition and safe for public use.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b7"
  },
  "name": "Onkilaituri",
  "coordinates": {
    "lat": 60.24129229999999,
    "lon": 24.9731694
  },
  "url": "",
  "quests": "fi_type",
  "category": "pier",
  "description": "Onkilaituri refers to a fishing pier or a fishing platform. Several locations in the Helsinki metropolitan area feature these, including one in Savelanpuisto, located in the Malmi district along the Vantaanjoki river. This particular onkilaituri was built following a proposal from residents in the OmaStadi participatory budgeting initiative. Another accessible fishing pier can be found by Kirkas-Soljanen lake in Ylöjärvi, near Helsinki. These piers provide a dedicated and safe space for fishing enthusiasts, enhancing recreational opportunities along the waterfronts. There is also an onkilaituri in Viikinmäki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b8"
  },
  "name": "Vartiokylänlahti Recreation Pier",
  "coordinates": {
    "lat": 60.2187245,
    "lon": 25.1218006
  },
  "url": "https://itahelsinki.fi/vartiokylanlahteen-avattiin-uusi-oleskelulaituri/",
  "quests": "fi_type",
  "category": "pier",
  "description": "Vartiokylänlahti is a long and narrow sea bay located in eastern Helsinki, between Vuosaari and Vartiokylä. A 417-meter-long bridge and a metro bridge cross it. The bay is surrounded by residential areas and outdoor spaces, featuring shorelines with walking paths. There are also several small boat harbors. A recreation pier, Varjakanvalkama, was built on the shore with the help of participatory budgeting, based on the idea of local residents. This pier is the first of its kind in Helsinki, providing a place for relaxation and enjoying the coastal scenery. The bay is a valuable natural site being developed as a maritime housing area and a green and recreational connection for eastern Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5b9"
  },
  "name": "Fishing Pier of Siltamäki Park",
  "coordinates": {
    "lat": 60.2798092,
    "lon": 24.990424
  },
  "url": "https://walttia.fi/9346109508226375529/",
  "quests": "fi_type",
  "category": "pier",
  "description": "While specific details about a fishing pier in Siltamäki Park are limited, Helsinki is a maritime city known for its good fishing facilities. Siltamäki Sports Park, located in the area, offers diverse exercise facilities but doesn't specifically mention a fishing pier. It features fields and courts for various ball games, an ice rink, a disc golf course, and an outdoor gym. If you are interested in fishing in Helsinki, it's best to explore Helsinki's fishing grounds, fishing spots, and regulations or contact local fishing gear shops for more information on locations and equipment rental.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ba"
  },
  "name": "Tove Jansson Park",
  "coordinates": {
    "lat": 60.1678097,
    "lon": 24.9610139
  },
  "url": "https://www.myhelsinki.fi/fi/places/tove-janssonin-puisto/",
  "quests": "fi_type",
  "category": "park",
  "description": "Tove Jansson Park, located in the Katajanokka district of Helsinki, is a charming park named after the famous Finnish author and artist Tove Jansson. Established in 1897 and originally known as Katajanokka Park, it was renamed in 2014 to honor Jansson's 100th birthday. The park offers scenic views of the Uspenski Cathedral with its golden cupolas.\n\nWithin the park, you can find the Vedenkantaja statue, a bronze sculpture of a young woman dressed in ancient attire. A playground with a \"Mystical Sea Adventure\" theme is set to open in Spring 2026, featuring Moomin illustrations and a Moomin statue, celebrating Jansson's connection to the sea. The park also includes areas for children to play and even a dog park. With its beautiful trees, flowerbeds, and tranquil atmosphere, Tove Jansson Park is a perfect spot to relax and enjoy nature.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5bb"
  },
  "name": "Kolmikulma",
  "coordinates": {
    "lat": 60.1649881,
    "lon": 24.9435957
  },
  "url": "https://fi.wikipedia.org/wiki/Kolmikulma_(Helsinki)",
  "quests": "fi_type",
  "category": "park",
  "description": "Kolmikulma, also known as Dianapuisto (Diana Park), is a small, triangular-shaped park in the heart of Helsinki. It's bordered by Yrjönkatu, Uudenmaankatu, and Erottajankatu streets. The park's shape is due to its location at the intersection of two grid-patterned areas. In the park, you can find the statue \"Tellervo, Tapio's daughter\" (1928) by Yrjö Liipola, which is often referred to as \"Diana,\" hence the park's nickname. The park was renovated in 2006 and 2007. A Swedish-language children's theater, Unga Teatern, operates near the park.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5bc"
  },
  "name": "Eiranpuisto",
  "coordinates": {
    "lat": 60.15755060000001,
    "lon": 24.9408638
  },
  "url": "https://www.myhelsinki.fi/fi/places/eiranpuisto/",
  "quests": "fi_type",
  "category": "park",
  "description": "Eiranpuisto, also known as Eira Park, is a beautiful park located in Helsinki, Finland, established in the early 1900s alongside the Eira district. It was originally called Eiranpuistikko and nicknamed \"Kukkapuisto\" (Flower Park). Designed in a traditional baroque style, the park is perfect for strolling and relaxation. You can admire the plants and relax on benches among trees and flower beds. The park also features walking paths along the coastline, offering beautiful sea views, and dedicated pathways for cycling and jogging. In 2000, a marble sculpture called \"Three Vessel-Carrying Boys\" was placed in the park's southwest corner.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5bd"
  },
  "name": "Meripuisto",
  "coordinates": {
    "lat": 60.1551577,
    "lon": 24.9460415
  },
  "url": "https://fi.wikipedia.org/wiki/Meripuisto_(Helsinki)",
  "quests": "fi_type",
  "category": "park",
  "description": "Meripuisto is a park located in the Ullanlinna district of Helsinki, between Merikatu street and the Merisatama harbour. The park is about 500 meters long but less than 100 meters wide. A street called Merisatamanranta runs between the park and the sea. In the past, the area was used for winter storage of boats and a railway yard. In the 1960s, an Esso service station was located in the park. Nowadays, Meripuisto is divided into open park space and functional areas, with a maritime-themed playground. There's also a nice area with benches where you can find peonies, lilies and blooming cherry trees in spring.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5be"
  },
  "name": "Saukonpaasi Park",
  "coordinates": {
    "lat": 60.15778299999999,
    "lon": 24.90661739999999
  },
  "url": "https://fi.wikipedia.org/wiki/Saukonpaasi",
  "quests": "fi_type",
  "category": "park",
  "description": "Saukonpaasi Park is located in Jätkäsaari, Helsinki, and was completed in 2021. It's built on reclaimed land from the old freight harbor. The park is designed for all ages, with attention to easy maintenance and durability. The eastern part acts as a green extension of the residential courtyards, while the western part offers sea views, grasses, and rock formations. Details appeal to different senses, with sunbathing areas, picnic spots, and outdoor musical instruments. There are stairs to the water and even access for winter swimming. The park also includes irrigation and electricity points for events.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5bf"
  },
  "name": "Väinämöinen Park",
  "coordinates": {
    "lat": 60.1735157,
    "lon": 24.9165587
  },
  "url": "",
  "quests": "fi_type",
  "category": "park",
  "description": "Väinämöisen Park is located in Etu-Töölö, Helsinki. It is next to Hietaniemi Park. It's also near Väiskin rocks. Väinämöisen field is located in the park. The park has a small, gentle slope that is good for sledding. In the winter, it's a great place for ice skating. The field was built in the 1930s and has remained largely in its original form.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c0"
  },
  "name": "Kaisaniemi Park",
  "coordinates": {
    "lat": 60.1750425,
    "lon": 24.9432986
  },
  "url": "https://fi.wikipedia.org/wiki/Kaisaniemen_puisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Kaisaniemi Park, known locally as Kaisis, is Helsinki's oldest and most central park, dating back to 1812. Named after restaurateur Cajsa Wahllund, it's a significant green space for the city and Finnish park culture. Located near the Central Railway Station, Kaisaniemi hosts numerous events, sports, and music festivals, including the World Village Festival. The park offers sports facilities like a football pitch, basketball, and tennis courts. It also features the Freemason's Grave, Helsinki's oldest public memorial. Adjacent to the park is the Kaisaniemi Botanic Garden, part of the University of Helsinki since 1829, with its oldest greenhouse opening in 1889.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c1"
  },
  "name": "Toukola Seaside Park",
  "coordinates": {
    "lat": 60.2057452,
    "lon": 24.9812975
  },
  "url": "https://www.artova.fi/10-rantapuisto/",
  "quests": "fi_type",
  "category": "park",
  "description": "Toukola Seaside Park (Toukola rantapuisto) is located in Helsinki, and it is part of the Arabianranta-Toukola district. It's a significant green area for recreation and nature, actively used by locals and forming a key part of the broader pedestrian and cycling network, especially in the north-south direction. The park is built on reclaimed land, some of which was formerly industrial. The design had to consider the sinking of the ground. The park covers an area of 45 hectares and has been under construction since the early 2000s.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c2"
  },
  "name": "Hesperianpuisto",
  "coordinates": {
    "lat": 60.1785706,
    "lon": 24.9303633
  },
  "url": "https://fi.wikipedia.org/wiki/Hesperianpuisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Hesperianpuisto is a park located in Helsinki, on the western shore of Töölönlahti bay, in the districts of Etu-Töölö and Taka-Töölö. It's bordered by Mannerheimintie in the west, Finlandia Hall in the south, and the Finnish National Opera to the north. The park extends as a narrow strip to Helsinginkatu, across from the Eläintarha park area.\n\nThe area was once the site of Töölö village's largest fields. In the 1800s, it was a villa area with an outdoor restaurant called Hesperia. The park has evolved over 200 years, retaining elements from different eras. The southern part is also known as Hakasalmi Park, though there is no clear boundary. The park features walking paths, lawns, and a playground.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c3"
  },
  "name": "Sinebrychoff Park",
  "coordinates": {
    "lat": 60.1620352,
    "lon": 24.9327924
  },
  "url": "https://fi.wikipedia.org/wiki/Sinebrychoffin_puisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Sinebrychoff Park, also known as \"Koff Park\", is a popular park located in Punavuori, Helsinki. It got its name from the Sinebrychoff brewery that operated nearby from 1819 to 1992. The park was originally a private garden, established by Russian businessman Nikolai Sinebrychoff. Opened to the public in 1835, it quickly became a favorite spot for Helsinki residents.\n\nThe park features abundant lilac bushes, ornamental apple and cherry trees, and a redbrick tower, which once was a part of a storage building and now belongs to the Haukka playground. Beneath the park runs the Mallaskatu tunnel. The Sinebrychoff Art Museum is located at the edge of the park in the former Sinebrychoff residence.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c4"
  },
  "name": "Alppipuisto",
  "coordinates": {
    "lat": 60.1904291,
    "lon": 24.9375641
  },
  "url": "https://fi.wikipedia.org/wiki/Alppipuisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Alppipuisto, located in the Alppiharju district of Helsinki, is a historically and culturally significant park established in the 1800s. Situated near the Linnanmäki amusement park, it's a popular recreational area known for its green spaces, duck ponds, and winding paths. The park features rocky cliffs, remnants of Helsinki's first ski jump, and a viewing platform where a restaurant once stood. In the summer, Alppipuisto hosts various events and festivals, including the Alppipuisto Sound music festival, and is easily accessible by public transport.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c5"
  },
  "name": "Lenin Park",
  "coordinates": {
    "lat": 60.1899999,
    "lon": 24.9429623
  },
  "url": "https://www.myhelsinki.fi/fi/places/lenininpuisto/",
  "quests": "fi_type",
  "category": "park",
  "description": "Lenin Park, or Lenininpuisto in Finnish, is located in Helsinki, near the Helsinki Hall of Culture. Originally known as Flower Park, it was renamed in 1970 to mark the 100th anniversary of Vladimir Lenin's birth. The park showcases how a diverse green space can flourish on rocky terrain. A collaboration between the City of Helsinki and the Gardening Association of Helsinki created a stream flowing into a basin and slate paths. While the park's name has sparked debate over the years, it remains a serene and historically significant part of Helsinki.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c6"
  },
  "name": "Old Church Park",
  "coordinates": {
    "lat": 60.16599289999999,
    "lon": 24.939863
  },
  "url": "https://fi.wikipedia.org/wiki/Vanha_kirkkopuisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Old Church Park, also known as \"Plague Park,\" is a popular green space in central Helsinki, located in the Kamppi district. The park gets its nickname from the plague victims buried there in 1710. The park is the site of the Old Church, designed by Carl Ludvig Engel and completed in 1826. Though intended to be temporary, it is now the second oldest church in Helsinki. The park was converted from a cemetery in 1829, and gravestones still remind visitors of its history. Today, it's a place for recreation, events, and enjoying the atmosphere.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c7"
  },
  "name": "Nyrkkeilijänpuisto",
  "coordinates": {
    "lat": 60.17832199999999,
    "lon": 24.9482476
  },
  "url": "https://www.hamhelsinki.fi/veistos/nyrkkeilijat/",
  "quests": "fi_type",
  "category": "park",
  "description": "Nyrkkeilijänpuisto (Boxer's Park) is located in Helsinki. The park features a statue called \"Nyrkkeilijät\" (The Boxers), created by Johannes Haapasalo. The statue was unveiled in 1932 in Paasivuoren puistikko. It depicts two boxers in a fighting stance. The models for the sculpture were Uuno Pitkä and Armas Wilkman, who were boxers from Helsingin Jyry.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c8"
  },
  "name": "Tokoinranta",
  "coordinates": {
    "lat": 60.1805002,
    "lon": 24.9411867
  },
  "url": "https://fi.wikipedia.org/wiki/Tokoinranta",
  "quests": "fi_type",
  "category": "park",
  "description": "Tokoinranta is a park located in Kallio, Helsinki, on the shore of Eläintarhanlahti bay, west of Hakaniemi market square. The Helsinki City Theatre is situated on the park's northern side. In the eastern part of Tokoinranta, there's a small playground for children and a bronze memorial called \"Soihtu\" (The Torch) dedicated to Miina Sillanpää, created in 1968. On the park's western side is the former Café Piritta building. During late summer, the Huvila tent is erected in the park for concerts during the Helsinki Festival. Previously, there were boat rental spots by the shore in Tokoinranta, but they were removed in 2008 due to low demand.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5c9"
  },
  "name": "Myllykallio birdwatching tower",
  "coordinates": {
    "lat": 60.1591293,
    "lon": 24.8648262
  },
  "url": "https://www.myhelsinki.fi/places/myllykallion-bird-watching-tower/",
  "quests": "fi_type",
  "category": "birdtower",
  "description": "Myllykallio birdwatching tower is located on Myllykallio hill in Lauttasaari, Helsinki. The hill is a forested green area and the highest point in western Lauttasaari, reaching 31 meters. The tower offers great views over the surrounding area and the sea. During World War II, the site was home to one of Helsinki's heavy anti-aircraft batteries. A 76 mm anti-aircraft gun has been left as a memorial of the war. Myllykallio is a popular destination for birdwatchers and nature lovers. It is also a nice place to take in the scenery."
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ca"
  },
  "name": "Laajalahti Nature Preserve",
  "coordinates": {
    "lat": 60.1890836,
    "lon": 24.8173525
  },
  "url": "https://www.luontoon.fi/fi/kohteet/laajalahden-luonnonsuojelualue",
  "quests": "fi_type",
  "category": "nature_reserve",
  "description": "Laajalahti Nature Reserve, located in Espoo near Helsinki, is one of southern Finland's best bird wetlands. Established in 1989, this almost 200-hectare conservation area protects a shallow sea bay and promotes nature observation. It's an internationally significant wetland, crucial for abundant breeding birds and thousands of migrating birds. Nature trails offer easy exploration, with several short paths starting from Villa Elfvik, including an accessible route for wheelchairs and strollers. The area has birdwatching towers and diverse landscapes, including reedbeds and coastal meadows.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5cb"
  },
  "name": "Elvik Bird Hide",
  "coordinates": {
    "lat": 60.199912,
    "lon": 24.8239936
  },
  "url": "",
  "quests": "fi_type",
  "category": "birdtower",
  "description": "One option near Helsinki is the bird hide located in the Laajalahti Nature Reserve in Espoo. The Laajalahti Nature Reserve is known as the best birding area in southern Finland, protecting a shallow sea bay crucial for breeding and migratory birds. The bird watching tower is accessible via the Villa Elfvik nature trail, approximately 800 meters long, and is also accessible for wheelchairs and prams. Another is Piilokoju Birdwatching Hut in Helsinki's Vanhankaupunginlahti Nature Reserve. It is designed to blend into the landscape and offers an accessible space for observing waterfowl.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5cc"
  },
  "name": "Iso Huopalahti Bird Watching Area",
  "coordinates": {
    "lat": 60.2098161,
    "lon": 24.845236
  },
  "url": "",
  "quests": "fi_type",
  "category": "birdtower",
  "description": "Iso Huopalahti is a bay located on the border of Helsinki and Espoo. It's known as a locally valuable bird area. The western part of the bay is covered by a large reed bed. The most important places for birds are on the Helsinki side: the Mätäoja brook, the deciduous forests and bushes east of the former landfill, and the eastern shore of the bay. The area used to be one of the best birding sites, but its ornithological value has decreased since the 1980s. However, during migration seasons, many waterbirds and waders stay in the bay. It is a worthwhile destination, especially as a nightingale site, where many warblers and nightingales sing in May-June."
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5cd"
  },
  "name": "Helsinki Arch (Sculpture)",
  "coordinates": {
    "lat": 60.1906049,
    "lon": 24.88261129999999
  },
  "url": "https://www.hamhelsinki.fi/en/sculptures/helsinki-arch-the-helsinki-arch/",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Helsinki Arch, created by Bernard Kirschenbaum in 1983, is located at Tamminiementie 6, Meilahti, Helsinki. It exemplifies minimalism, an art movement that emerged in the 1960s in opposition to abstract expressionism. Minimalist artists aimed to avoid overt emotionalism in their works, focusing instead on the form and material of the piece itself, using simple shapes and colors. Made of steel, the arch was initially displayed in front of the Ateneum Art Museum during the Ars 83 exhibition. The artist has detached the arch from its historical connections to militaristic ceremonies and created a sign that refers to new kinds of associations.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ce"
  },
  "name": "Aleksis Kivi Statue",
  "coordinates": {
    "lat": 60.17169810000001,
    "lon": 24.9439149
  },
  "url": "https://en.wikipedia.org/wiki/Aleksis_Kivi_Memorial",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Aleksis Kivi statue, sculpted by Wäinö Aaltonen, is a bronze memorial dedicated to the renowned Finnish author Aleksis Kivi (1834–1872). It is located in Helsinki Railway Square, in front of the Finnish National Theatre, and was unveiled on October 10, 1939. The statue portrays Kivi sitting contemplatively in a chair. Reliefs inspired by Kivi's works, including \"Sydämeni laulu\", \"Keinu\", and \"Seitsemän veljestä pakenee Impivaarasta,\" adorn the chair. The back of the chair features stanzas from his poem \"Ikävyys\" (Melancholy). The Helsinki Art Museum owns and maintains the statue.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5cf"
  },
  "name": "Sibelius Monument",
  "coordinates": {
    "lat": 60.1820451,
    "lon": 24.9134289
  },
  "url": "https://en.wikipedia.org/wiki/Sibelius_Monument",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Sibelius Monument, located in Sibelius Park in Helsinki's Töölö district, is a tribute to the renowned Finnish composer Jean Sibelius. Created by Eila Hiltunen, it was unveiled in 1967. The sculpture, named \"Passio Musicae\", features over 600 welded steel pipes, resembling organ pipes in a wave-like pattern. It weighs 24 tons and measures 8.5 meters in height, 10.5 meters in length and 6.5 meters in depth. The monument also includes a bust of Sibelius. A smaller version is located at the UNESCO headquarters in Paris. The monument is a popular tourist attraction.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d0"
  },
  "name": "The Skin Sculptor",
  "coordinates": {
    "lat": 60.158238,
    "lon": 24.9103718
  },
  "url": "",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Skin Sculptor is a skin clinic located in Jätkäsaari, Helsinki. It's easily accessible by tram. The clinic focuses on providing individual service with natural and safe results. They offer a wide range of treatments, including laser hair removal and facial treatments. They also use high-quality, plant-based ingredients that work in harmony with the skin's biochemistry. The goal is to help clients achieve their dream skin, leaving them glowing, relaxed, and pampered. The clinic also has an online store.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d1"
  },
  "name": "Paavo Nurmi Statue",
  "coordinates": {
    "lat": 60.18433599999999,
    "lon": 24.9268828
  },
  "url": "https://en.wikipedia.org/wiki/Paavo_Nurmi_statue",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Paavo Nurmi statue, created by Wäinö Aaltonen in 1925, is a bronze sculpture depicting the legendary Finnish runner Paavo Nurmi. It's not a realistic portrait but rather an idealized monument to the Finnish runner. Five full-size casts, measuring 2.2 meters in height, were created. One statue is located in front of the Helsinki Olympic Stadium, unveiled for the 1952 Helsinki Olympics, and is part of the Helsinki City Art Collection. Other casts are in various locations, including the Ateneum Art Museum, Turku, Lausanne in Switzerland, and Jyväskylä. The statue has become a symbol of Finnish sport and national identity.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d2"
  },
  "name": "Flock of Geese (Sculpture)",
  "coordinates": {
    "lat": 60.1844813,
    "lon": 24.9629446
  },
  "url": "https://www.hamhelsinki.fi/en/sculptures/hanhiparvi-flock-of-geese/",
  "quests": "fi_type",
  "category": "sight",
  "description": "\"Flock of Geese\" (Hanhiparvi) is a sculpture by Pirkko Nukari, located in Lintulahti, Helsinki. Created in 2000, the life-size bronze geese appear to be guarding the plaza. The sculptures are modeled after domestic geese. According to the artist, geese make excellent guards because they are noisy when something unusual occurs. Nature, especially birds, is a recurring theme in Nukari's art. The work was commissioned by the area's developer, Skanska, to add vibrancy to the newly constructed residential district. Although located in Helsinki, it is not part of the Helsinki City Art Collection managed by HAM.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d3"
  },
  "name": "Ässärykmentti Memorial (Sculpture)",
  "coordinates": {
    "lat": 60.18311000000001,
    "lon": 24.9557769
  },
  "url": "https://evendo.com/locations/finland/helsinki/kallio/landmark/assarykmentti-memorial-sculpture",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Ässärykmentti Memorial, also known as the Infantry Regiment 11 Memorial, is located in Alli Trygg's park in Helsinki. It commemorates the soldiers of Infantry Regiment 11, who fell in the Winter War of 1939-1940. The memorial is a granite obelisk designed by sculptor Aarre Aaltonen and was erected in 1940. The front of the obelisk features the inscription: \"The survivors of Infantry Regiment 11 erected this statue in memory of their heroic comrades who fell in the war 1939-40, 13.10.1940\". The street rising from Hämeentie to Alli Trygg Park is named Ässänrinne (Ace Slope) after the regiment. Due to the lion relief on the obelisk, it is also known as the Lion Statue.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d4"
  },
  "name": "The Bear on the Anthill (sculpture)",
  "coordinates": {
    "lat": 60.1840109,
    "lon": 24.9521469
  },
  "url": "https://www.hamhelsinki.fi/en/sculptures/mesikammen-muurahaispesalla-the-bear-on-the-anthill/",
  "quests": "fi_type",
  "category": "sight",
  "description": "\"The Bear on the Anthill\", or *Mesikämmen muurahaispesällä* in Finnish, is a red granite sculpture located in Karhupuisto (Bear Park) in the Kallio district of Helsinki. Created by Jussi Mäntynen and unveiled in 1931, it depicts a bear, Finland's national animal, bending over an anthill. Mäntynen was known for his lifelike portrayals of animals, stemming from his work as a taxidermist at the University of Helsinki. The sculpture combines anatomical accuracy with a naturalistic composition, conveying strength and self-respect. The park itself is named after this famous sculpture, making it a beloved landmark.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d5"
  },
  "name": "Tauno Palo Memorial (Sculpture)",
  "coordinates": {
    "lat": 60.1860041,
    "lon": 24.9449556
  },
  "url": "https://fi.wikipedia.org/wiki/Tauno_Palon_muistomerkki",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Tauno Palo Memorial, located in Tauno Palo Park in Helsinki's Kallio district, commemorates the renowned Finnish actor. Created by sculptor Kain Tapper in 1993, it's a multi-part artwork integrated into the park's landscape. The memorial features a minimalist granite structure composed of two stacked blocks with textured surfaces. A bronze portrait relief of Palo is mounted separately near the street. The artwork also includes a water basin with a small stream and rose plantings. Tapper described the granite as representing Palo's robust nature, while the roses and water symbolize the artist's sensitivity. The park itself, with its stone wall, paths, and stairs, was designed in collaboration with Tapper, forming a unified environment.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d6"
  },
  "name": "Haaga Rhododendron Park",
  "coordinates": {
    "lat": 60.22181759999999,
    "lon": 24.8938686
  },
  "url": "https://fi.wikipedia.org/wiki/Haagan_Alppiruusupuisto",
  "quests": "fi_type",
  "category": "park",
  "description": "Haaga Rhododendron Park, or \"Alppiruusupuisto\" in Finnish, is a unique park located in the Haaga district of Helsinki. It serves as both a public park and a research garden for the University of Helsinki. The park is divided into two sections: the southern part features evergreen rhododendrons, while the northern part showcases deciduous azaleas. The blooming season peaks in early June, with azaleas flowering first, sometimes lasting even after Midsummer. The park was established in 1975 with the aim of breeding rhododendrons suitable for the Finnish climate and has wooden walkways for visitors. It's a popular spot, attracting thousands of locals and garden enthusiasts during the flowering season.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d7"
  },
  "name": "Viikin pelto",
  "coordinates": {
    "lat": 60.22420919999999,
    "lon": 25.0251663
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/ulkoilualueet/viikin-luontoalue",
  "quests": "fi_type",
  "category": "field",
  "description": "Viikin pelto is a valuable combination of bird wetland, field and forest in Viikki, Helsinki. The fields are part of the University of Helsinki's Viikki Research Farm, providing infrastructure for research, teaching, and outreach. The fields are located in the middle of the Viikki recreational area and the university campus. Crops and grass silage for 60 cows are produced in the fields. Part of the fields are used as pasture for cows every year. The fields are an essential part of the birdlife of Vanhankaupunginlahti, serving as feeding and resting areas.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d8"
  },
  "name": "Viikki Arboretum",
  "coordinates": {
    "lat": 60.22004079999999,
    "lon": 25.0066118
  },
  "url": "https://fi.wikipedia.org/wiki/Viikin_arboretum",
  "quests": "fi_type",
  "category": "forest",
  "description": "Viikki Arboretum is located in Helsinki, it was established in 1969 for dendrological research and teaching purposes. It is part of the Vanhankaupunginlahti outdoor and recreational area. The arboretum covers approximately 20 hectares and features both Finnish and foreign tree and shrub species that thrive in Finland. Foreign species are from areas in the northern hemisphere that closely resemble Finland. Currently, there are around 250 different tree and shrub species growing in the area. It serves as a popular recreational area and a valuable green space within the city.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5d9"
  },
  "name": "Malminkartano Apple Tree Garden",
  "coordinates": {
    "lat": 60.2509618,
    "lon": 24.8693374
  },
  "url": "https://www.stadissa.fi/paikat/2058/malminkartanon-omenatarha",
  "quests": "fi_type",
  "category": "garden",
  "description": "Malminkartano Apple Tree Garden is located in western Helsinki. It's a spacious garden with hundreds of apple trees, as well as some pear, plum, and cherry trees. Originally, it was a research project for the University of Helsinki. Nowadays, it's a public park where people can have picnics and pick apples. The city usually organizes apple picking events in the autumn, and during May, when the trees are in bloom, people come to admire the blossoms. The garden has tables for picnics and open gates for public access. It's a green and peaceful area that offers a chance to enjoy nature and outdoor activities.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5da"
  },
  "name": "Meilahti Rosarium",
  "coordinates": {
    "lat": 60.1930734,
    "lon": 24.8898127
  },
  "url": "https://vihreatsylit.fi/meilahden-rosarium/",
  "quests": "fi_type",
  "category": "garden",
  "description": "Meilahti Rosarium is located in Helsinki, within the Meilahti Arboretum, between Johannesbergintie and Meilahdentie. The rosarium showcases a collection of European historical roses and hardy Finnish shrub roses. The rose varieties are grouped according to their historical or botanical background, and each rose has a name tag. The first rose collection was established in 1991, and it was renovated in 2006-2007, when many varieties were replaced. All the roses are shrub roses, and there are no hybrid tea roses. In addition to the rose bushes, there is also a perennial group and a pergola for climbing roses and clematis. The rose varieties have been selected in collaboration with the Finnish Rose Society. The best time to visit is usually from mid-June to mid-August.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5db"
  },
  "name": "Meilahti arboretum",
  "coordinates": {
    "lat": 60.19260009999999,
    "lon": 24.8897376
  },
  "url": "https://vihreatsylit.fi/meilahden-arboretum/",
  "quests": "fi_type",
  "category": "park",
  "description": "Meilahti Arboretum, established in 1967, is located in Helsinki between Johannesbergintie and Meilahdentie streets. This peaceful park covering over three hectares showcases a variety of trees and shrubs, with over 300 species identified with nameplates. A highlight is the rosarium, featuring a collection of shrub roses. The park is designed for educational purposes, inviting visitors to explore and learn about plants within a lush environment. It is managed by the City of Helsinki, with the Finnish Rose Society also contributing to the upkeep of the rose garden.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5dc"
  },
  "name": "Helsinki Winter Garden",
  "coordinates": {
    "lat": 60.1861305,
    "lon": 24.9316635
  },
  "url": "https://fi.wikipedia.org/wiki/Talvipuutarha",
  "quests": "fi_type",
  "category": "garden",
  "description": "Helsinki Winter Garden (Talvipuutarha in Finnish) is a greenhouse located in Helsinki, near Töölönlahti Bay. Established in 1893, it has been a popular place for recreation. The garden is open to the public year-round with no admission fee. It features three distinct rooms: the Palm Room, the Cactus Room, and the West Wing, each offering different botanical experiences with over 200 plant species. During the Christmas and Easter seasons, the garden is decorated with seasonal flowers and decorations. In the summer, the rose garden in front of the Winter Garden is a sight to see.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5dd"
  },
  "name": "Kaisaniemi Botanic Garden",
  "coordinates": {
    "lat": 60.1753256,
    "lon": 24.9457344
  },
  "url": "https://en.wikipedia.org/wiki/University_of_Helsinki_Botanical_Garden",
  "quests": "fi_type",
  "category": "garden",
  "description": "The Kaisaniemi Botanic Garden, established in 1829, is located in the heart of Helsinki. It's one of the two botanical gardens of the University of Helsinki. The garden features diverse collections of living plants both outdoors and in glasshouses. The glasshouses offer a tropical atmosphere, showcasing plants from rainforests and deserts. The outdoor garden is landscaped in an English style, with a formal garden at its center. It includes a systematic garden, a sensory garden, ponds, and flower displays, providing a unique experience for nature enthusiasts all year round.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5de"
  },
  "name": "Niskalan arboretum",
  "coordinates": {
    "lat": 60.2743447,
    "lon": 24.93698569999999
  },
  "url": "https://www.myhelsinki.fi/fi/places/niskalan-arboretum/",
  "quests": "fi_type",
  "category": "park",
  "description": "Niskala Arboretum is located in Helsinki, near the Haltiala farm in the northeastern part of the Central Park. Founded in the early 20th century by Jakob Kavaleff, it was initially a show area for his nursery. The arboretum features over 700 plant species from around the world and is divided into different continents. It has a small pond, adventure trails, and benches for picnics. In 1984, the 2.2-hectare original arboretum was declared a nature conservation area. Today, visitors can explore the area using the new signposts and nature trails.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5df"
  },
  "name": "Kuusijärvi Outdoor Recreation Area",
  "coordinates": {
    "lat": 60.3134585,
    "lon": 25.1105991
  },
  "url": "https://naturaviva.fi/en_US/kuusijarvi-outdoor-area",
  "quests": "fi_type",
  "category": "recreation_area",
  "description": "Kuusijärvi Outdoor Recreation Area, located in Vantaa near Helsinki, is a popular year-round destination. In summer, it offers a sandy beach for swimming and sunbathing, along with hiking trails. Winter transforms it into a haven for ice swimming and cross-country skiing. A unique feature is the public smoke saunas, available during the winter season. A pedestrian bridge connects Kuusijärvi to Sipoonkorpi National Park, expanding hiking opportunities. The area also has a cafe, and provides facilities like restrooms, and meeting spaces.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e0"
  },
  "name": "Sudentassu",
  "coordinates": {
    "lat": 60.3118826,
    "lon": 25.124169
  },
  "url": "https://fi.wikipedia.org/wiki/Sudentassu",
  "quests": "fi_type",
  "category": "bridge",
  "description": "Sudentassu, also known as Sipoonkorpi bridge, is located in Vantaa and it connects the outdoor recreation area of Kuusijärvi and Sipoonkorpi National Park. The name \"Sudentassu\" translates to \"wolf's paw\" in English. This pedestrian and cycling bridge stretches 126 meters in length and stands 20 meters high, offering an easy way to cross from one rocky cliff to another. It was opened in December 2019. The bridge's architecture is inspired by the surrounding nature and the railings are decorated with animal and plant motifs of the area. In 2021, Sudentassu was awarded the Bridge of the Year prize in Finland.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e1"
  },
  "name": "Bisajärvi Cooking Shelter",
  "coordinates": {
    "lat": 60.30730279999999,
    "lon": 25.1489295
  },
  "url": "https://naturaviva.fi/fi_FI/sipoonkorven-kansallispuiston-tulipaikat",
  "quests": "fi_type",
  "category": "campfire",
  "description": "The Bisajärvi Cooking Shelter, or \"Bisajärven keittokatos\" in Finnish, is located in Sipoonkorpi National Park, near Helsinki. It's a simple open-sided structure with a roof, designed to provide a space for cooking outdoors. Inside, there is usually a fire pit or grill, often with a chimney to direct smoke away. The cooking shelter provides a roof over your head but is open on the sides. These shelters typically accompany picnic tables and a woodshed. It is about 3 kilometers away from Kuusijärvi. These cooking shelters offer a practical and safe environment for visitors to prepare food and enjoy a meal in nature. Camping is allowed near the campfire sites at Bisajärvi.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e2"
  },
  "name": "Högberget",
  "coordinates": {
    "lat": 60.2858088,
    "lon": 25.1531994
  },
  "url": "https://fi.wikipedia.org/wiki/H%C3%B6gberget_(Vantaa)",
  "quests": "fi_type",
  "category": "hill",
  "description": "Högberget is a notable location in the Helsinki metropolitan area. There are multiple places called Högberget. In Vantaa, Högberget is a 74-meter-high hill within the Sipoonkorpi forest. Its prominent cliff face rises 50 meters above the surrounding Sotunki farmland. The summit features smooth rock formations shaped during the Ice Age. Högberget became part of Sipoonkorpi National Park in 2011.\n\nIn Kirkkonummi, close to Helsinki, Högberget's Cave is a unique erosion cave formed during the Ice Age. Meltwater carved a vertical, onion-shaped hole in the rock. It's also known as the \"Womb of Mother Earth\" because the cave's entrance resembles a vagina. The cave is about 6.5 meters long, 2 meters tall, and 1 meter wide.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e3"
  },
  "name": "Kalkkiruukki Lean-to Shelter",
  "coordinates": {
    "lat": 60.2962322,
    "lon": 25.1577251
  },
  "url": "https://www.luontoon.fi/en/destinations/sipoonkorpi-national-park/service/kalkkiruukki-laavu-lean-to-shelter-135022-en",
  "quests": "fi_type",
  "category": "lean-to",
  "description": "Kalkkiruukki Lean-to Shelter is located in Vantaa, within the Sipoonkorpi National Park. It's situated along the Kalkinpolttajanpolku trail and is easily accessible from Kalkkiuunintie road. The area has historical significance, formerly belonging to the Håkansböle Manor, where limestone was mined and burned. The lean-to provides a resting spot for hikers. It includes a campfire site, a dry toilet, table-bench sets and a sleeping shelter. Camping is allowed nearby. The Kalkinpolttajanpolku Trail, leading to the shelter, is a 4.8 km circular route known for its varied terrain, including forests and rocky cliffs. It's a popular spot, especially on weekends.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e4"
  },
  "name": "Bakunkärr Cooking Shelter",
  "coordinates": {
    "lat": 60.29595519999999,
    "lon": 25.1882638
  },
  "url": "https://retkipaikka.fi/bakunkarrin-kierros-sipoonkorven-kansallispuistossa/",
  "quests": "fi_type",
  "category": "campfire",
  "description": "The Bakunkärr Cooking Shelter is located in Sipoonkorpi National Park, about 20 kilometers from Helsinki. It's situated on a cliff near Lake Bakunkärrträsket, along the Knuters Trail. The shelter is spacious, featuring a fireplace and seating for a large group. Next to the shelter, on top of the cliff, are tables and benches. A firewood shed and a dry toilet with toilet paper are also available. The Bakunkärr Trail, a 2-kilometer loop, leads to the cooking shelter, with the path to the shelter marked by orange diamonds. Tenting is permitted at the Bakunkärr fireplace, within designated camping areas.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e5"
  },
  "name": "Pirttimäki Outdoor Recreation Area",
  "coordinates": {
    "lat": 60.26962989999999,
    "lon": 24.6510302
  },
  "url": "https://www.hel.fi/fi/kulttuuri-ja-vapaa-aika/ulkoilu-puistot-ja-luontokohteet/ulkoilualueet/pirttimaen-ulkoilualue",
  "quests": "fi_type",
  "category": "recreation_area",
  "description": "Pirttimäki Outdoor Recreation Area, owned by the city of Helsinki, is a 430-hectare area located in Espoo. It's a popular destination for outdoor activities year-round. The area features diverse terrain shaped by the Ice Age, including steep cliffs, boulders, lakes, ponds, and wetlands.\n\nPirttimäki is a great starting point for hiking and skiing, with 20 km of marked trails. The trails are also suitable for mountain biking. In winter, cross-country skiing tracks are maintained. The area also includes Pirttimäki lodge with a café and rental saunas. Additionally, there's a 1.8-hectare hazel grove which is a unique sight.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e6"
  },
  "name": "Meerlampi Cave",
  "coordinates": {
    "lat": 60.292444,
    "lon": 24.576629
  },
  "url": "https://retkipaikka.fi/meerlammenluola/",
  "quests": "fi_type",
  "category": "cave",
  "description": "Meerlampi Cave, also known as Meerlammen luola in Finnish, is located in Espoo, near Helsinki. It's a natural rock shelter featuring massive boulders, inviting exploration. Situated close to the Haltia Nature Centre and Nuuksio National Park, it's easily accessible for tourists and locals alike. The cave provides a unique opportunity to admire Finland's natural landscape and geological formations. The surrounding area offers peaceful spots near the water, ideal for picnics and photography, making it a perfect destination for family outings or solo adventures in nature. It's open year-round, showcasing the beauty of every season.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e7"
  },
  "name": "Maahisenkierros Observation Deck",
  "coordinates": {
    "lat": 60.2896622,
    "lon": 24.5677008
  },
  "url": "https://www.hagerlund.net/sv/node/2941",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Maahisenkierros Observation Deck is located in Nuuksio, near the Finnish Nature Center Haltia. The 2 km trail leading to the deck is mostly accessible, even with a wheelchair and prams with assistance, and offers beautiful views. The path goes through the forest and rocky pine forest. The highlight is the observation deck with a magnificent view over Lake Pitkäjärvi. The wide path has a hard surface, and there are resting spots along the route where you can sit and enjoy the scenery.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e8"
  },
  "name": "Kattilajärvi Beach",
  "coordinates": {
    "lat": 60.2984732,
    "lon": 24.6206986
  },
  "url": "https://www.espoo.fi/fi/toimipisteet/kattilajarven-uimaranta",
  "quests": "fi_type",
  "category": "beach",
  "description": "Kattilajärvi Beach is located in Espoo, in the Nuuksio lake district, surrounded by a nature reserve. It's known as one of the most peaceful and secluded beaches in the Helsinki Metropolitan Area. The beach itself is small but clean. The area is quiet, almost silent, and the Kattilaniemi camping site is nearby. Getting there is easiest by car, as it's a few kilometers from Nuuksiontie. There's also a campfire site, cooking shelter and well. You can swim from the sandy beach or from the pier. The water is clear and the landscape is beautiful.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5e9"
  },
  "name": "Holma-Saarijärvi campsite",
  "coordinates": {
    "lat": 60.30151109999999,
    "lon": 24.4944135
  },
  "url": "https://naturaviva.fi/fi_FI/nuuksion-kansallispuiston-telttailualueet/holma-saarijarven-telttailualue",
  "quests": "fi_type",
  "category": "campsite",
  "description": "Holma-Saarijärvi campsite is located in the heart of Nuuksio National Park, near Helsinki. It offers beautiful scenery and peaceful nature. There are two camping areas open to everyone. One is on an island on the southern shore of Holma-Saarijärvi. This campsite is a central spot in Nuuksio National Park and is often busy. Facilities include a campfire site, a lean-to shelter next to the bridge to the island, and an outhouse. The other camping area is on the western shore of the lake, also equipped with a campfire site and an outhouse. Holma-Saarijärvi is a great hiking and swimming location.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ea"
  },
  "name": "Rajakallio",
  "coordinates": {
    "lat": 60.3007211,
    "lon": 24.5100226
  },
  "url": "",
  "quests": "fi_type",
  "category": "hill",
  "description": "Rajakallio appears in several contexts in the Helsinki metropolitan area. One is a climbing area in Lahti, about an hour's drive from Helsinki, known for winter climbing. Another Rajakallio is a cliff area located in Haukilahti, Espoo, near the Gulf of Finland. Haukilahti is a quiet neighborhood with forests and parks. Karoliina Rajakallio is also mentioned as Unit Director, Enterprise Resource Planning at Kaupunkiliikenne Oy, the Helsinki city transport company. Finally, Rajakallio is mentioned near Nuuksio park as a place to find hotels nearby.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5eb"
  },
  "name": "Haukkalampi Scenic Spot",
  "coordinates": {
    "lat": 60.3109852,
    "lon": 24.50328559999999
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Haukkalampi is located in the eastern part of Nuuksio National Park, Espoo. It is a popular recreational area with a pond, the Natura Viva rental place, and Café Haukka. Several marked trails begin from Haukkalampi Nature Information Hut, including a 2 km nature trail and the 8 km Korpinkierros trail. The 4 km Haukankierros trail is a popular day trip that circles Haukkalampi. You can also find campfire sites, camping areas, and cooking shelters with firewood. A connecting trail leads to the Finnish Nature Center Haltia. The Hawk's Nest sauna is a popular place to relax after hiking.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ec"
  },
  "name": "Poseidon Temple",
  "coordinates": {
    "lat": 60.14292399999999,
    "lon": 24.7576133
  },
  "url": "https://fi.wikipedia.org/wiki/Iso_Vasikkasaari",
  "quests": "fi_type",
  "category": "sight",
  "description": "It seems there might be multiple places named \"Poseidonin Temppeli\" (Temple of Poseidon) in Finland.\n\nOne is located on Iso Vasikkasaari island in Espoo, near Helsinki. It is not actually a temple, but a private building built in the late 19th century as a villa in the style of a Greek temple. A municipal counselor built it for his son-in-law, a professor of the Greek language. Today, the \"temple\" is used as a fishing lodge and was once the workspace of the sociologist Erik Allardt.\n\nAnother \"Poseidonin Temppeli\" is a bus/metro station in Helsinki.\n\nThere is also the actual Temple of Poseidon, located in Sounion, near Athens, Greece. It was built in 444–440 BC, featuring 42 white marble columns, and housed a six-meter bronze statue of Poseidon.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ed"
  },
  "name": "Lukukallio rock",
  "coordinates": {
    "lat": 60.18811279999999,
    "lon": 24.7556251
  },
  "url": "",
  "quests": "fi_type",
  "category": "sight",
  "description": "Lukukallio is a rocky, forested area located in Espoo, near Helsinki, specifically east of Kehä II (Ring Road II) and opposite Suurpelto. It's being planned for housing and commercial development, with considerations to preserve its natural features and ecological connections. The area is known for being a relatively quiet area due to the elevation of the rock which helps to block out noise. It also serves as a habitat for species such as the Siberian flying squirrel.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ee"
  },
  "name": "Lookout Point",
  "coordinates": {
    "lat": 60.1902937,
    "lon": 24.6946944
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "Helsinki offers many scenic viewpoints. One popular spot is Malminkartanonhuippu, the highest point in Helsinki, created from landfill. Climbing its 426 steps rewards you with panoramic city views. Another option is the tower of the Helsinki Olympic Stadium, standing at 72 meters, it provides a historical perspective of the city. For a different experience, visit Ateljee Bar on top of Hotel Torni, offering stunning views of the coastline and city center from a rooftop terrace. Kaivopuisto Park also provides scenic ocean cliffs overlooking the southern coast and archipelago."
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5ef"
  },
  "name": "Salapaikka",
  "coordinates": {
    "lat": 60.1957163,
    "lon": 24.7429255
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "\"Salapaikka\" translates to \"secret place\" or \"hideout\" in Finnish. It can refer to a favorite, personal spot where one can relax and contemplate. However, \"Salapaikka\" is also the name of a shop, Salakauppa (Secret Shop), located in Helsinki. Salakauppa is a shop run by COMPANY (Aamu Song & Johan Olin) that sells unique items and has a history of art installations and special events. The shop's interior has a mural painting filled with workshops, factories and travel stories. The shop also has a small studio in the back where they make more products.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f0"
  },
  "name": "World War I Fortresses",
  "coordinates": {
    "lat": 60.20295529999999,
    "lon": 24.7934121
  },
  "url": "",
  "quests": "fi_type",
  "category": "forest",
  "description": "During World War I (1914-1918), a fortification zone was built around Helsinki as part of Russia's defense of St. Petersburg. This included three lines of land fortifications in Helsinki, Vantaa, and Espoo, and coastal artillery. Known as Krepost Sveaborg, it extended around Helsinki with structures like trenches and concrete shelters. The fortifications, built by Finnish workers and even Chinese laborers, were largely unused. Today, over 300 structures remain, some preserved while others have been destroyed, offering a glimpse into WWI-era military engineering in the Helsinki region. Some locations like Mustavuori have well-preserved trenches and caves.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f1"
  },
  "name": "Taivarin mäki",
  "coordinates": {
    "lat": 60.2065786,
    "lon": 24.7945061
  },
  "url": "",
  "quests": "fi_type",
  "category": "hill",
  "description": "Taivarinmäki, also known as Taivari, was a ski jumping hill located in Laajalahti, Espoo. The landing slope of the hill was removed and became unusable due to the construction of the Tarvontie road. It is mentioned among other old place names in the Espoo area.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f2"
  },
  "name": "Stockmann Ruins",
  "coordinates": {
    "lat": 60.2172074,
    "lon": 24.69701079999999
  },
  "url": "https://retkipaikka.fi/luontoaiti-katkee-kauniaisten-suurimman-salaisuuden-stockmannin-rauniot/",
  "quests": "fi_type",
  "category": "sight",
  "description": "The Stockmann Ruins are located in Kauniainen, near Helsinki. These aren't actually ruins but the foundation of an unfinished mansion. Frans Stockmann, from the famous Stockmann department store family, started building the grandiose villa in the early 1900s, but construction was halted when he and his wife died of the Spanish flu in 1919 and 1920, respectively. Today, the stone foundation sits in the forest, with nature slowly reclaiming it. Visitors can explore the site, where they can also find graffiti art. The ruins offer a glimpse into what might have been a magnificent home and a reminder of a tragic period in history.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f3"
  },
  "name": "Matalajärvi Birdwatching Tower",
  "coordinates": {
    "lat": 60.24967359999999,
    "lon": 24.6981715
  },
  "url": "https://www.hagerlund.net/fi/matalajarven-lintutorni",
  "quests": "fi_type",
  "category": "birdtower",
  "description": "Matalajärvi birdwatching tower is located in Espoo, next to the Matalajärvi lake. The lake is part of the Natura 2000 network and Nuuksio National Park and is a nationally significant bird wetland. From the bird tower, you can spot various bird species like the Whooper Swan, the Coot, and the Common Snipe. The lake is shallow, with a maximum depth of just over a meter, making it an important resting area for migrating birds. The tower provides a good view of almost the entire lake area. It is recommended to bring a telescope but binoculars are also sufficient to spot birds. The closest parking area is at Pehtorinaukio from where you can walk to the lake.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f4"
  },
  "name": "Hilan louhos",
  "coordinates": {
    "lat": 60.0650319,
    "lon": 24.4102218
  },
  "url": "",
  "quests": "fi_type",
  "category": "quarry",
  "description": "Hilan louhos is a former quarry located in Kirkkonummi, near Helsinki. Mining operations started in 1986 and ceased almost 20 years ago after an expansion permit was rejected. A lake with depths of up to 11 meters has formed in the quarry. The steep quarry walls, reaching nearly 10 meters high, and inadequate safety fences create a dangerous environment. Despite this, the quarry has become a popular, though hazardous, swimming and diving spot, attracting both families and young people. There have been issues with disturbances and parking problems in the area.\n"
},
{
  "_id": {
    "$oid": "67e1055c9b29afec97a7c5f5"
  },
  "name": "Torhola Cave",
  "coordinates": {
    "lat": 60.2522467,
    "lon": 23.856694
  },
  "url": "https://fi.wikipedia.org/wiki/Torholan_luola",
  "quests": "fi_type",
  "category": "cave",
  "description": "Torhola Cave is Finland's largest limestone cave, located in Lohja, not near Helsinki. To reach it, you can take a 1.5-hour bus ride from Helsinki to Karkali and then walk about 500 meters. The cave is around 30 meters long with narrow passages and cavities to explore, reaching depths of up to 12 meters. It was mainly formed by melting water after the last Ice Age. The surrounding area has elm and lime forests with various plant and fungus species. Inside the cave, there are often ice formations in winter. Non-slip shoes and a flashlight are recommended.\n"
}]